docs/zinnia.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-08 Sun 01:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<h1><a href="/vrtk-wiki/">VRTK Wiki</a></h1>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde6da67">Zinnia</a>
<ul>
<li><a href="#orga7d8dfb">Action</a>
<ul>
<li><a href="#org8b3c014">Collection</a>
<ul>
<li><a href="#org71cc370"><span class="api-link" data-link="/db/ddb/class_zinnia_1_1_action_1_1_collection_1_1_action_observable_list.html">ActionObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org430fe6d"><span class="api-link" data-link="/d7/d7c/class_zinnia_1_1_action_1_1_collection_1_1_action_registrar_source_observable_list.html">ActionRegistrarSourceObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgc2c0a40"><span class="api-link" data-link="/d4/dc2/class_zinnia_1_1_action_1_1_action.html">Action&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org426c896"><span class="api-link" data-link="/df/dde/class_zinnia_1_1_action_1_1_all_action.html">AllAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgfcc20f0"><span class="api-link" data-link="/df/dea/class_zinnia_1_1_action_1_1_any_action.html">AnyAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgf42ce1e"><span class="api-link" data-link="/de/dc7/class_zinnia_1_1_action_1_1_boolean_action.html">BooleanAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgc8a145c"><span class="api-link" data-link="/d4/d7f/class_zinnia_1_1_action_1_1_float_action.html">FloatAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org568e6f2"><span class="api-link" data-link="/d7/deb/class_zinnia_1_1_action_1_1_state_emitter.html">StateEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgdb8cb87"><span class="api-link" data-link="/d2/d84/class_zinnia_1_1_action_1_1_surface_change_action.html">SurfaceChangeAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org1ad95a6"><span class="api-link" data-link="/d2/dea/class_zinnia_1_1_action_1_1_toggle_action.html">ToggleAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org7e2af44"><span class="api-link" data-link="/d4/d34/class_zinnia_1_1_action_1_1_vector2_action.html">Vector2Action&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org852d29c"><span class="api-link" data-link="/d2/dae/class_zinnia_1_1_action_1_1_action_registrar.html">ActionRegistrar&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orga3011de">Association</a>
<ul>
<li><a href="#org6d929f0">Collection</a>
<ul>
<li><a href="#orga936e9a"><span class="api-link" data-link="/d8/d01/class_zinnia_1_1_association_1_1_collection_1_1_game_objects_association_observable_list.html">GameObjectsAssociationObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgd9fa22b"><span class="api-link" data-link="/d0/d34/class_zinnia_1_1_association_1_1_game_objects_association.html">GameObjectsAssociation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgd05a9e2"><span class="api-link" data-link="/d3/de3/class_zinnia_1_1_association_1_1_game_objects_association_activator.html">GameObjectsAssociationActivator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org11ced9d"><span class="api-link" data-link="/dd/db3/class_zinnia_1_1_association_1_1_loaded_xr_device_association.html">LoadedXrDeviceAssociation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgfe6f20d">Cast</a>
<ul>
<li><a href="#org3748b35">Collection</a>
<ul>
<li><a href="#org091ce7a">Mutation</a>
<ul>
<li><a href="#org28399b0"><span class="api-link" data-link="/d1/da3/class_zinnia_1_1_cast_1_1_operation_1_1_mutation_1_1_points_cast_property_mutator.html">PointsCastPropertyMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6266a21"><span class="api-link" data-link="/d4/d8f/class_zinnia_1_1_cast_1_1_physics_cast.html">PhysicsCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org98ecdb1"><span class="api-link" data-link="/d7/d7b/class_zinnia_1_1_cast_1_1_points_cast.html">PointsCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a>
<ul>
<li><a href="#org2de3952"><span class="api-link" data-link="/dc/de8/class_zinnia_1_1_tracking_1_1_follow_1_1_object_follower_1_1_event_data.html">EventData&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org253cbba"><span class="api-link" data-link="/d1/dc3/class_zinnia_1_1_cast_1_1_fixed_line_cast.html">FixedLineCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orga1a4a15"><span class="api-link" data-link="/d4/d8e/class_zinnia_1_1_cast_1_1_straight_line_cast.html">StraightLineCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org2b010ad"><span class="api-link" data-link="/dc/dd0/class_zinnia_1_1_cast_1_1_parabolic_line_cast.html">ParabolicLineCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgb17c8be">Data</a>
<ul>
<li><a href="#orged4930c">Attribute</a>
<ul>
<li><a href="#org1ea8550"><span class="api-link" data-link="/db/d13/class_zinnia_1_1_data_1_1_attribute_1_1_custom_inspector_text_attribute.html">CustomInspectorTextAttribute&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org33d3975"><span class="api-link" data-link="/d2/d42/class_zinnia_1_1_data_1_1_attribute_1_1_min_max_range_attribute.html">MinMaxRangeAttribute&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org8bd2766"><span class="api-link" data-link="/d6/d16/class_zinnia_1_1_data_1_1_attribute_1_1_restricted_attribute.html">RestrictedAttribute&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org9030892"><span class="api-link" data-link="/dd/d90/class_zinnia_1_1_data_1_1_attribute_1_1_type_picker_attribute.html">TypePickerAttribute&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org5fc2425">Collection</a>
<ul>
<li><a href="#orga13d002">Counter</a>
<ul>
<li><a href="#org8995fa1"><span class="api-link" data-link="/d7/d70/class_zinnia_1_1_data_1_1_collection_1_1_counter_1_1_observable_counter.html">ObservableCounter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org5039b51"><span class="api-link" data-link="/d9/db6/class_zinnia_1_1_data_1_1_collection_1_1_counter_1_1_game_object_observable_counter.html">GameObjectObservableCounter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org2f16599">List</a>
<ul>
<li><a href="#org278f25f"><span class="api-link" data-link="/dd/d86/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_observable_list.html">ObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org7d394dc"><span class="api-link" data-link="/d2/dfb/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_behaviour_observable_list.html">BehaviourObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org17babf5"><span class="api-link" data-link="/d0/dc5/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_default_observable_list.html">DefaultObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org4afe1d1"><span class="api-link" data-link="/de/d32/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_float_observable_list.html">FloatObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org11c8056"><span class="api-link" data-link="/d3/d48/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_game_object_observable_list.html">GameObjectObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org4dd9eec"><span class="api-link" data-link="/de/da0/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_game_object_relation_observable_list.html">GameObjectRelationObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org445e965"><span class="api-link" data-link="/de/dd6/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_serializable_type_behaviour_observable_list.html">SerializableTypeBehaviourObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orga9a6553"><span class="api-link" data-link="/d1/d04/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_serializable_type_component_observable_list.html">SerializableTypeComponentObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgae27e76"><span class="api-link" data-link="/dc/d08/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_string_observable_list.html">StringObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org8acfa2c"><span class="api-link" data-link="/d8/d1b/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_unity_object_observable_list.html">UnityObjectObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org0d866f7"><span class="api-link" data-link="/da/d02/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_vector2_observable_list.html">Vector2ObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org5c8522d"><span class="api-link" data-link="/d6/df5/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_vector3_observable_list.html">Vector3ObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org93f11d0">Stack</a>
<ul>
<li><a href="#org2392f5e"><span class="api-link" data-link="/d3/d88/class_zinnia_1_1_data_1_1_collection_1_1_stack_1_1_observable_stack.html">ObservableStack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org8052ffe"><span class="api-link" data-link="/df/d41/class_zinnia_1_1_data_1_1_collection_1_1_stack_1_1_game_object_observable_stack.html">GameObjectObservableStack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga7f5d8b">Enum</a>
<ul>
<li><a href="#org5fef296">TransformProperties</a></li>
</ul>
</li>
<li><a href="#orgd5b3d43">Operation</a>
<ul>
<li><a href="#orgd8b4cfd">Extraction</a>
<ul>
<li><a href="#orgc3f975b"><span class="api-link" data-link="/d5/d9a/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_game_object_extractor.html">GameObjectExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orga21ad28"><span class="api-link" data-link="/db/d86/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_component_game_object_extractor.html">ComponentGameObjectExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org0ea20f2"><span class="api-link" data-link="/da/d50/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_surface_data_collision_point_extractor.html">SurfaceDataCollisionPointExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org0b95df2"><span class="api-link" data-link="/dd/d73/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_data_game_object_extractor.html">TransformDataGameObjectExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org32cd3fc"><span class="api-link" data-link="/de/d8a/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_direction_extractor.html">TransformDirectionExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org0876868"><span class="api-link" data-link="/da/d9c/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_euler_rotation_extractor.html">TransformEulerRotationExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orge87de73"><span class="api-link" data-link="/d1/d3d/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_position_extractor.html">TransformPositionExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgf8a18f5"><span class="api-link" data-link="/db/dee/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_property_extractor.html">TransformPropertyExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orga8ff79f"><span class="api-link" data-link="/d4/d34/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_scale_extractor.html">TransformScaleExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org4451b21"><span class="api-link" data-link="/d8/da7/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_vector2_component_extractor.html">Vector2ComponentExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgaf344bf"><span class="api-link" data-link="/d5/dc9/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_vector3_extractor.html">Vector3Extractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orged0369f">Mutation</a>
<ul>
<li><a href="#org9ff3c5d"><span class="api-link" data-link="/d8/d88/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_rigidbody_property_mutator.html">RigidbodyPropertyMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org2e589f1"><span class="api-link" data-link="/d7/d80/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_transform_euler_rotation_mutator.html">TransformEulerRotationMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org276929b"><span class="api-link" data-link="/da/d3b/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_transform_position_mutator.html">TransformPositionMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org0e8d396"><span class="api-link" data-link="/dc/d65/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_transform_property_mutator.html">TransformPropertyMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org16f091d"><span class="api-link" data-link="/d0/d26/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_transform_scale_mutator.html">TransformScaleMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orge40c072">GameObjectCloner</a></li>
</ul>
</li>
<li><a href="#org957c4cb">Type</a>
<ul>
<li><a href="#org28527c3">Transformation</a>
<ul>
<li><a href="#orgd48ef79">Aggregation</a>
<ul>
<li><a href="#org8ba1feb"><span class="api-link" data-link="/db/d2d/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_collection_aggregator.html">CollectionAggregator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org4380aac"><span class="api-link" data-link="/dc/d70/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_float_adder.html">FloatAdder&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org65e88e1"><span class="api-link" data-link="/d3/d88/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_float_multiplier.html">FloatMultiplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgebd1b76"><span class="api-link" data-link="/d8/d46/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_vector2_multiplier.html">Vector2Multiplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgeca8866"><span class="api-link" data-link="/d6/d1c/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_vector3_multiplier.html">Vector3Multiplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org7670297"><span class="api-link" data-link="/d5/d4f/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_vector3_subtractor.html">Vector3Subtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org93eef08">Conversion</a>
<ul>
<li><a href="#org1972ccc"><span class="api-link" data-link="/d2/d12/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_angle_to_vector2_direction.html">AngleToVector2Direction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgfd887f6"><span class="api-link" data-link="/de/d52/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_boolean_to_float.html">BooleanToFloat&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org90c025c"><span class="api-link" data-link="/de/d34/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_float_to_boolean.html">FloatToBoolean&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orge5d86f3"><span class="api-link" data-link="/d2/dfd/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_float_to_vector2.html">FloatToVector2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org438070d"><span class="api-link" data-link="/dd/df5/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_float_to_vector3.html">FloatToVector3&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org188e9ba"><span class="api-link" data-link="/db/d3d/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector2_to_angle.html">Vector2ToAngle&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org46725c2"><span class="api-link" data-link="/d8/dc3/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector2_to_float.html">Vector2ToFloat&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgf979e9f"><span class="api-link" data-link="/d2/dd2/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector2_to_vector3.html">Vector2ToVector3&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgc35dc6e"><span class="api-link" data-link="/d0/d38/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector3_to_float.html">Vector3ToFloat&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org5f294ee"><span class="api-link" data-link="/d5/d3d/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector3_to_vector2.html">Vector3ToVector2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orga8ebc73"><span class="api-link" data-link="/dd/d34/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_float_range_value_remapper.html">FloatRangeValueRemapper&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgc25a707"><span class="api-link" data-link="/d0/d23/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_transformer.html">Transformer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org2f68474"><span class="api-link" data-link="/d7/d44/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_vector3_magnitude_setter.html">Vector3MagnitudeSetter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org2b3929b"><span class="api-link" data-link="/df/d56/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_vector3_restrictor.html">Vector3Restrictor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org51eb8f3">FloatRange</a></li>
<li><a href="#orge08c876">HeapAllocationFreeReadOnlyList</a></li>
<li><a href="#org1c663ae"><span class="api-link" data-link="/d3/d9b/class_zinnia_1_1_data_1_1_type_1_1_serializable_type.html">SerializableType&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org6e90c89"><span class="api-link" data-link="/dc/d32/class_zinnia_1_1_data_1_1_type_1_1_surface_data.html">SurfaceData&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org9b964ac"><span class="api-link" data-link="/d2/dc6/class_zinnia_1_1_data_1_1_type_1_1_transform_data.html">TransformData&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org8ddcfce">Vector3State</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfe10611">Event</a>
<ul>
<li><a href="#org8066e73">Proxy</a>
<ul>
<li><a href="#org7962e08"><span class="api-link" data-link="/d3/de4/class_zinnia_1_1_event_1_1_proxy_1_1_empty_event_proxy_emitter.html">EmptyEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org394140c"><span class="api-link" data-link="/d6/d15/class_zinnia_1_1_event_1_1_proxy_1_1_event_proxy_emitter.html">EventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org1a22a9f"><span class="api-link" data-link="/d9/d64/class_zinnia_1_1_event_1_1_proxy_1_1_float_event_proxy_emitter.html">FloatEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org4df8697"><span class="api-link" data-link="/db/da4/class_zinnia_1_1_event_1_1_proxy_1_1_game_object_event_proxy_emitter.html">GameObjectEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orge64f52a"><span class="api-link" data-link="/df/d94/class_zinnia_1_1_event_1_1_proxy_1_1_restrictable_single_event_proxy_emitter.html">RestrictableSingleEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgbbfa69a"><span class="api-link" data-link="/d7/d74/class_zinnia_1_1_event_1_1_proxy_1_1_single_event_proxy_emitter.html">SingleEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgda68f70"><span class="api-link" data-link="/d8/d49/class_zinnia_1_1_event_1_1_proxy_1_1_surface_data_proxy_emitter.html">SurfaceDataProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org697ac10"><span class="api-link" data-link="/d0/d34/class_zinnia_1_1_event_1_1_proxy_1_1_transform_data_proxy_emitter.html">TransformDataProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org290248b"><span class="api-link" data-link="/d9/d44/class_zinnia_1_1_event_1_1_behaviour_enabled_observer.html">BehaviourEnabledObserver&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org014293e">Extension</a>
<ul>
<li><a href="#orgdc31666"><span class="api-link" data-link="/d9/d68/class_zinnia_1_1_extension_1_1_array_sort_extensions.html">ArraySortExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org3d5a0b6"><span class="api-link" data-link="/d7/dda/class_zinnia_1_1_extension_1_1_behaviour_extensions.html">BehaviourExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgc77bd9f"><span class="api-link" data-link="/dc/dfe/class_zinnia_1_1_extension_1_1_collider_extensions.html">ColliderExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgf4be90a"><span class="api-link" data-link="/d1/d33/class_zinnia_1_1_extension_1_1_component_extensions.html">ComponentExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgf0000e0"><span class="api-link" data-link="/d3/de9/class_zinnia_1_1_extension_1_1_float_extensions.html">FloatExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org9a22ee4"><span class="api-link" data-link="/db/d03/class_zinnia_1_1_extension_1_1_game_object_extensions.html">GameObjectExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org481e6f4"><span class="api-link" data-link="/d7/d81/class_zinnia_1_1_extension_1_1_i_read_only_collection_extensions.html">IReadOnlyCollectionExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org087c9cf"><span class="api-link" data-link="/d3/dea/class_zinnia_1_1_extension_1_1_rule_container_extensions.html">RuleContainerExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org92568db"><span class="api-link" data-link="/d0/de0/class_zinnia_1_1_extension_1_1_transform_data_extensions.html">TransformDataExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org83c1083"><span class="api-link" data-link="/d2/dba/class_zinnia_1_1_extension_1_1_transform_extensions.html">TransformExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgbacd65c"><span class="api-link" data-link="/dd/dfe/class_zinnia_1_1_extension_1_1_vector2_extensions.html">Vector2Extensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orga8352f0"><span class="api-link" data-link="/d5/d57/class_zinnia_1_1_extension_1_1_vector3_extensions.html">Vector3Extensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgddcbde9">Haptics</a>
<ul>
<li><a href="#org066de6d">Collection</a>
<ul>
<li><a href="#org62c0b5c"><span class="api-link" data-link="/de/de1/class_zinnia_1_1_haptics_1_1_collection_1_1_haptic_process_observable_list.html">HapticProcessObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org72a4454"><span class="api-link" data-link="/d7/dee/class_zinnia_1_1_haptics_1_1_audio_clip_haptic_pulser.html">AudioClipHapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orga84b546"><span class="api-link" data-link="/d7/d72/class_zinnia_1_1_haptics_1_1_audio_source_haptic_pulser.html">AudioSourceHapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgf6e272e"><span class="api-link" data-link="/d6/d06/class_zinnia_1_1_haptics_1_1_haptic_process.html">HapticProcess&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org559fcf7"><span class="api-link" data-link="/d5/d4e/class_zinnia_1_1_haptics_1_1_haptic_processor.html">HapticProcessor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgfe3c03f"><span class="api-link" data-link="/d7/d34/class_zinnia_1_1_haptics_1_1_haptic_pulser.html">HapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgdb99927"><span class="api-link" data-link="/d8/dc8/class_zinnia_1_1_haptics_1_1_routine_haptic_pulser.html">RoutineHapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgdea9c5d">TimedHapticPulser</a></li>
<li><a href="#orgd4329dc"><span class="api-link" data-link="/dc/d08/class_zinnia_1_1_haptics_1_1_x_r_node_haptic_pulser.html">XRNodeHapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org4154bb5">Pointer</a>
<ul>
<li><a href="#orgee963f6">Operation</a>
<ul>
<li><a href="#org6933c97">Mutation</a>
<ul>
<li><a href="#orgabd24a5"><span class="api-link" data-link="/dd/def/class_zinnia_1_1_pointer_1_1_operation_1_1_mutation_1_1_pointer_element_property_mutator.html">PointerElementPropertyMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb468d26"><span class="api-link" data-link="/df/daa/class_zinnia_1_1_pointer_1_1_object_pointer.html">ObjectPointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orge172bf4"><span class="api-link" data-link="/d1/dcc/class_zinnia_1_1_pointer_1_1_pointer_element.html">PointerElement&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org18c187d">Process</a>
<ul>
<li><a href="#orga065939">Component</a>
<ul>
<li><a href="#org80de79e"><span class="api-link" data-link="/dc/dd4/class_zinnia_1_1_process_1_1_component_1_1_game_object_source_target_processor.html">GameObjectSourceTargetProcessor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orge745819"><span class="api-link" data-link="/d0/d55/class_zinnia_1_1_process_1_1_component_1_1_source_target_processor.html">SourceTargetProcessor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgc4c0390">Moment</a>
<ul>
<li><a href="#org5051f54">Collection</a>
<ul>
<li><a href="#org3887099"><span class="api-link" data-link="/de/db3/class_zinnia_1_1_process_1_1_moment_1_1_collection_1_1_moment_process_observable_list.html">MomentProcessObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgc84d92c"><span class="api-link" data-link="/d7/dc7/class_zinnia_1_1_process_1_1_moment_1_1_composite_process.html">CompositeProcess&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgb9a5282"><span class="api-link" data-link="/da/dc7/class_zinnia_1_1_process_1_1_moment_1_1_moment_process.html">MomentProcess&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgdf0de5d"><span class="api-link" data-link="/da/d64/class_zinnia_1_1_process_1_1_moment_1_1_moment_processor.html">MomentProcessor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orga602407"><span class="api-link" data-link="/d0/d80/class_zinnia_1_1_process_1_1_event_process.html">EventProcess&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgf33bc95"><span class="api-link" data-link="/d8/d03/interface_zinnia_1_1_process_1_1_i_processable.html">IProcessable&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org7f317b7"><span class="api-link" data-link="/dd/dd5/class_zinnia_1_1_process_1_1_process_container.html">ProcessContainer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgc5bb529">Rule</a>
<ul>
<li><a href="#orgf75afb3">Collection</a>
<ul>
<li><a href="#orgc8be393"><span class="api-link" data-link="/d3/d31/class_zinnia_1_1_rule_1_1_collection_1_1_rule_container_observable_list.html">RuleContainerObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgd175179"><span class="api-link" data-link="/de/d92/class_zinnia_1_1_rule_1_1_collection_1_1_rules_matcher_element_observable_list.html">RulesMatcherElementObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org28b1e9b"><span class="api-link" data-link="/db/d6e/class_zinnia_1_1_rule_1_1_active_in_hierarchy_rule.html">ActiveInHierarchyRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgc9503f8"><span class="api-link" data-link="/de/d19/class_zinnia_1_1_rule_1_1_all_rule.html">AllRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org6bbe9f3"><span class="api-link" data-link="/d7/de0/class_zinnia_1_1_rule_1_1_any_behaviour_enabled_rule.html">AnyBehaviourEnabledRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org39d04ea"><span class="api-link" data-link="/d5/d13/class_zinnia_1_1_rule_1_1_any_component_type_rule.html">AnyComponentTypeRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgc0a45ad"><span class="api-link" data-link="/d7/d9b/class_zinnia_1_1_rule_1_1_any_layer_rule.html">AnyLayerRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgc6150a8"><span class="api-link" data-link="/d9/dd0/class_zinnia_1_1_rule_1_1_any_rule.html">AnyRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgf487504"><span class="api-link" data-link="/dc/d33/class_zinnia_1_1_rule_1_1_any_tag_rule.html">AnyTagRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgee87f26"><span class="api-link" data-link="/dd/d9f/class_zinnia_1_1_rule_1_1_game_object_rule.html">GameObjectRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgda671da"><span class="api-link" data-link="/d4/dd5/interface_zinnia_1_1_rule_1_1_i_rule.html">IRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgf2ca785"><span class="api-link" data-link="/d0/d92/class_zinnia_1_1_rule_1_1_list_contains_rule.html">ListContainsRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgb53ca4d"><span class="api-link" data-link="/d9/d69/class_zinnia_1_1_rule_1_1_negation_rule.html">NegationRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org3e520eb"><span class="api-link" data-link="/d4/dad/class_zinnia_1_1_rule_1_1_rule.html">Rule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org153bdb4"><span class="api-link" data-link="/d7/d35/class_zinnia_1_1_rule_1_1_rule_container.html">RuleContainer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org3376a2a"><span class="api-link" data-link="/db/da5/class_zinnia_1_1_rule_1_1_rules_matcher.html">RulesMatcher&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgb3d0755">Tracking</a>
<ul>
<li><a href="#orgb52b8b1">CameraRig</a>
<ul>
<li><a href="#orgc438e38">Collection</a>
<ul>
<li><a href="#orgdda51d5"><span class="api-link" data-link="/d1/d7f/class_zinnia_1_1_tracking_1_1_camera_rig_1_1_collection_1_1_linked_alias_association_collection_observable_list.html">LinkedAliasAssociationCollectionObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org0b0adca">Operation</a>
<ul>
<li><a href="#org6d8356c">Extraction</a>
<ul>
<li><a href="#org6a2143a"><span class="api-link" data-link="/d2/d41/class_zinnia_1_1_tracking_1_1_camera_rig_1_1_operation_1_1_extraction_1_1_play_area_dimensions_extractor.html">PlayAreaDimensionsExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3bbc8c5"><span class="api-link" data-link="/d4/d85/class_zinnia_1_1_tracking_1_1_camera_rig_1_1_linked_alias_association_collection.html">LinkedAliasAssociationCollection&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgdbf9704">Collision</a>
<ul>
<li><a href="#org26b4eba">Active</a>
<ul>
<li><a href="#org80ece1d">Event</a>
<ul>
<li><a href="#orgf7db710">Proxy</a>
<ul>
<li><a href="#org005e969"><span class="api-link" data-link="/d3/d04/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_event_1_1_proxy_1_1_active_collision_consumer_event_proxy_emitter.html">ActiveCollisionConsumerEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgcbad0b8"><span class="api-link" data-link="/de/d5c/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_event_1_1_proxy_1_1_active_collisions_container_event_proxy_emitter.html">ActiveCollisionsContainerEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org979f647">Operation</a>
<ul>
<li><a href="#orgb1eb42f">Extraction</a>
<ul>
<li><a href="#org14fed43"><span class="api-link" data-link="/dc/d70/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_extraction_1_1_notifier_container_extractor.html">NotifierContainerExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org6af157b"><span class="api-link" data-link="/d0/d48/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_extraction_1_1_notifier_target_extractor.html">NotifierTargetExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org11a16f0"><span class="api-link" data-link="/d5/d68/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_extraction_1_1_publisher_container_extractor.html">PublisherContainerExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org1a4e60c"><span class="api-link" data-link="/d7/d2c/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_nearest_sorter.html">NearestSorter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org9c71e17"><span class="api-link" data-link="/dc/d82/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_order_reverser.html">OrderReverser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgc6fa151"><span class="api-link" data-link="/df/df5/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_slicer.html">Slicer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org2e7ce3d"><span class="api-link" data-link="/d4/d0c/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_active_collision_consumer.html">ActiveCollisionConsumer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgb81a4eb"><span class="api-link" data-link="/d7/dd9/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_active_collision_publisher.html">ActiveCollisionPublisher&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgdacd907"><span class="api-link" data-link="/d8/db2/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_active_collisions_container.html">ActiveCollisionsContainer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org142f069"><span class="api-link" data-link="/d8/dd7/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_collision_point_container.html">CollisionPointContainer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgbb890c8">Event</a>
<ul>
<li><a href="#org1b8e975">Proxy</a>
<ul>
<li><a href="#org08ddcc1"><span class="api-link" data-link="/d7/d33/class_zinnia_1_1_tracking_1_1_collision_1_1_event_1_1_proxy_1_1_collision_notifier_event_proxy_emitter.html">CollisionNotifierEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf269c2c"><span class="api-link" data-link="/df/de4/class_zinnia_1_1_tracking_1_1_collision_1_1_collision_ignorer.html">CollisionIgnorer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org36a492f"><span class="api-link" data-link="/d1/de4/class_zinnia_1_1_tracking_1_1_collision_1_1_collision_notifier.html">CollisionNotifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a>
<ul>
<li><a href="#orgfd7aa3b">CollisionNotifier.EventData</a></li>
</ul>
</li>
<li><a href="#org051457c"><span class="api-link" data-link="/dc/def/class_zinnia_1_1_tracking_1_1_collision_1_1_collision_tracker.html">CollisionTracker&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org562bf78">Follow</a>
<ul>
<li><a href="#org14593a5">Modifier</a>
<ul>
<li><a href="#org0efb110">Property</a>
<ul>
<li><a href="#org5ffdd29">Position</a>
<ul>
<li><a href="#org1d06288"><span class="api-link" data-link="/d8/dbb/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_position_1_1_rigidbody_velocity.html">RigidbodyVelocity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org4699946"><span class="api-link" data-link="/d4/d63/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_position_1_1_transform_position.html">TransformPosition&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgeb592fd">Rotation</a>
<ul>
<li><a href="#org7f5cdc4"><span class="api-link" data-link="/d6/dae/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_rotation_1_1_rigidbody_angular_velocity.html">RigidbodyAngularVelocity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org1ff3a25"><span class="api-link" data-link="/d0/d29/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_rotation_1_1_rigidbody_force_at_position.html">RigidbodyForceAtPosition&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgbe2f6ce"><span class="api-link" data-link="/da/d16/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_rotation_1_1_transform_position_difference_rotation.html">TransformPositionDifferenceRotation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org35416ba"><span class="api-link" data-link="/d5/d22/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_rotation_1_1_transform_rotation.html">TransformRotation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org69ea326">Scale</a>
<ul>
<li><a href="#org8d0b89b"><span class="api-link" data-link="/d7/d80/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_scale_1_1_transform_scale.html">TransformScale&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org7cac917"><span class="api-link" data-link="/d3/d97/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_property_modifier.html">PropertyModifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org7a4fb11"><span class="api-link" data-link="/da/dec/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_follow_modifier.html">FollowModifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org7f112ad">Operation</a>
<ul>
<li><a href="#org106fd3f">Extraction</a>
<ul>
<li><a href="#orgcdd459f"><span class="api-link" data-link="/d0/d77/class_zinnia_1_1_tracking_1_1_follow_1_1_operation_1_1_extraction_1_1_object_distance_comparator_event_data_extractor.html">ObjectDistanceComparatorEventDataExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcd8dc58"><span class="api-link" data-link="/de/dd0/class_zinnia_1_1_tracking_1_1_follow_1_1_object_distance_comparator.html">ObjectDistanceComparator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org7d0d534"><span class="api-link" data-link="/d1/d01/class_zinnia_1_1_tracking_1_1_follow_1_1_object_follower.html">ObjectFollower&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgcd78e5b">Modification</a>
<ul>
<li><a href="#orgd9282b7">Operation</a>
<ul>
<li><a href="#org459358f">Extraction</a>
<ul>
<li><a href="#org7aaaa3d"><span class="api-link" data-link="/df/d8b/class_zinnia_1_1_tracking_1_1_modification_1_1_operation_1_1_extraction_1_1_transform_property_applier_event_data_extractor.html">TransformPropertyApplierEventDataExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga4e24c3"><span class="api-link" data-link="/df/d54/class_zinnia_1_1_tracking_1_1_modification_1_1_component_enabled_state_modifier.html">ComponentEnabledStateModifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org3593cd4"><span class="api-link" data-link="/dd/d7f/class_zinnia_1_1_tracking_1_1_modification_1_1_direction_modifier.html">DirectionModifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orga364657"><span class="api-link" data-link="/d4/d2e/class_zinnia_1_1_tracking_1_1_modification_1_1_game_object_state_mirror.html">GameObjectStateMirror&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org35d9f0a"><span class="api-link" data-link="/de/d2d/class_zinnia_1_1_tracking_1_1_modification_1_1_game_object_state_switcher.html">GameObjectStateSwitcher&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgc777c72"><span class="api-link" data-link="/d8/d9f/class_zinnia_1_1_tracking_1_1_modification_1_1_pinch_scaler.html">PinchScaler&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orga057ddd"><span class="api-link" data-link="/db/d91/class_zinnia_1_1_tracking_1_1_modification_1_1_point_normal_rotator.html">PointNormalRotator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org4fb3fdc"><span class="api-link" data-link="/da/d91/class_zinnia_1_1_tracking_1_1_modification_1_1_transform_property_applier.html">TransformPropertyApplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgc771c91">Query</a>
<ul>
<li><a href="#org2cba11e"><span class="api-link" data-link="/d3/da4/class_zinnia_1_1_tracking_1_1_query_1_1_facing_query.html">FacingQuery&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org649db01"><span class="api-link" data-link="/de/d8a/class_zinnia_1_1_tracking_1_1_query_1_1_obscurance_query.html">ObscuranceQuery&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org6fdba26">Velocity</a>
<ul>
<li><a href="#org2d9f5ce">Collection</a>
<ul>
<li><a href="#org68c4603">VelocityTrackerObservableList</a></li>
</ul>
</li>
<li><a href="#org13971d4"><span class="api-link" data-link="/db/d7b/class_zinnia_1_1_tracking_1_1_velocity_1_1_artificial_velocity_applier.html">ArtificialVelocityApplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org9323044"><span class="api-link" data-link="/d0/dfe/class_zinnia_1_1_tracking_1_1_velocity_1_1_average_velocity_estimator.html">AverageVelocityEstimator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org180d196"><span class="api-link" data-link="/d3/dd8/class_zinnia_1_1_tracking_1_1_velocity_1_1_component_tracker_proxy.html">ComponentTrackerProxy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org1c89382"><span class="api-link" data-link="/dc/d7f/class_zinnia_1_1_tracking_1_1_velocity_1_1_velocity_applier.html">VelocityApplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org899ce9c"><span class="api-link" data-link="/de/dc3/class_zinnia_1_1_tracking_1_1_velocity_1_1_velocity_emitter.html">VelocityEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org87ad21a"><span class="api-link" data-link="/db/d42/class_zinnia_1_1_tracking_1_1_velocity_1_1_velocity_multiplier.html">VelocityMultiplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#org9e7aef0"><span class="api-link" data-link="/d6/d78/class_zinnia_1_1_tracking_1_1_velocity_1_1_velocity_tracker.html">VelocityTracker&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgb0f04f4"><span class="api-link" data-link="/d7/da6/class_zinnia_1_1_tracking_1_1_velocity_1_1_velocity_tracker_processor.html">VelocityTrackerProcessor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgbf9d056"><span class="api-link" data-link="/d4/d1d/class_zinnia_1_1_tracking_1_1_velocity_1_1_x_r_node_velocity_estimator.html">XRNodeVelocityEstimator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgb52960b"><span class="api-link" data-link="/d6/d1c/class_zinnia_1_1_tracking_1_1_surface_locator.html">SurfaceLocator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#org9effd40">Utility</a>
<ul>
<li><a href="#org5d30ca3">BeizerCurveGenerator</a></li>
<li><a href="#orgd7e39e8"><span class="api-link" data-link="/d6/df9/class_zinnia_1_1_utility_1_1_countdown_timer.html">CountdownTimer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgb00161e"><span class="api-link" data-link="/da/d4f/class_zinnia_1_1_utility_1_1_interface_container.html">InterfaceContainer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
<li><a href="#orgb7c833b">Visual</a>
<ul>
<li><a href="#orgef74bc6"><span class="api-link" data-link="/d4/d4b/class_zinnia_1_1_visual_1_1_camera_color_overlay.html">CameraColorOverlay&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
<li><a href="#orgbaf35a0"><span class="api-link" data-link="/d6/d80/class_zinnia_1_1_visual_1_1_points_renderer.html">PointsRenderer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgde6da67" class="outline-2">
<h2 id="orgde6da67">Zinnia</h2>
<div class="outline-text-2" id="text-orgde6da67">
<p>
This page is community documentation for <a href="https://github.com/ExtendRealityLtd/Zinnia.Unity">Zinnia.Unity</a>, a package in
the VRTK family.
</p>

<p>
The generated API documentation can be found <a href="https://dustinlacewell.github.io/vrtk-wiki/zinnia/index.html">here</a>.
</p>
</div>
