src/zinnia.org
** Action
   Actions have two primary functions:
   - Receive values
   - Emit values

   There are a few ways an action can recieve values:
   - Its ~Receive()~ method.
   - An Action in its ~Sources~ list.

   When an Action receives a value, it also emits it.

   If an Action is a source for any other Action, values will be
   propagated along.

   Each Action has a number of Unity Events as well:
      - Activated
      - Deactivated
      - Activation State Changed
      - Value Changed

   By using the Value Changed event, you can respond to an Action's
   value in basically any way needed.

*** Collection
    Scripts for observing lists of action related types.

**** ActionObservableList                                               :api:
     Maintains a list of Zinnia Actions and emits events when that
     list is changed.

**** ActionRegistrarSourceObservableList                                :api:
     Maintains a list of [[ActionRegistrar]].ActionSource instances and
     emits events when that list changes.

*** Action                                                              :api:
    Base class for all [[Action]] types.

    Each action has a data-type, like float or GameObject.

    - Sources: A list of other Actions which this Action listens to.
    - UnityEvents:
      - Activation State Changed
      - Activated
      - Value Changed
      - Deactivated

*** AllAction                                                           :api:
    [[Action]] that emits a boolean when all the given actions are
    `Action.IsActivated`.

    - Actions: [[ActionObservableList]] of actions which all need to be
      activated.

*** AnyAction                                                           :api:
    [[Action]] that emits a boolean when any of the given actions are
    `Action.IsActivated`.

    - Actions: [[ActionObservableList]] of actions any of which need to be
      activated.

*** BooleanAction                                                       :api:
    [[Action]] that receives and emits booleans.

*** FloatAction                                                         :api:
    [[Action]] that receives and emits floats.

*** StateEmitter                                                        :api:
    An [[IProcessable]] which causes an [[Action]] to re-emit it's last value
    each time the process is run.

*** SurfaceChangeAction                                                 :api:
    [[Action]] that receives a [[SurfaceData]] current and emits when the
    current and previous positions exceed the specified distance.

*** ToggleAction                                                        :api:
    Alternates between emitting its Activated and Deactivated events
    each time Recieve is called.

*** Vector2Action                                                       :api:
    [[Action]] that recieves and emits Vector2 values.

*** ActionRegistrar                                                     :api:
    Sets the sources of a target [[Action]] based on a list of other
    Actions.

    The sources of an ActionRegistar are of type `ActionSource` which
    are a Action/GameObject pair. The GameObject is the one that
    contains the Action.

    The ActionRegistrar also maintains a list of GameObjects called
    the `SourceLimits`. This is basically a filter. Only the
    ActionSources that have a GameObject in this list are actually
    added as sources to the target Action.

    - Target: The Action whos sources will be set.
    - Sources: A list of ActionSources who's Actions will be set as
      the sources on the Target action.
    - SourceLimits: A list of GameObjects denoting valid parent
      GameObjects.

** Association
   Associations create a relation between some condition and the state
   of items in a collection.

   That is to say, some aspect of some collection of items, is
   determined by some condition.

   The only case right now is [[GameObjectsAssociation]] which relates
   whether a collection of GameObjects are (in)active based on some
   condition.
*** Collection
**** GameObjectsAssociationObservableList                               :api:
     An observable list of [[GameObjectsAssociation]] instances.
*** GameObjectsAssociation                                              :api:
    Abstract class which references a [[GameObjectObservableList]] of
    objects to (de)activate based on abstract boolean method
    `ShouldBeActive`.
*** GameObjectsAssociationActivator                                     :api:
    An [[IProcessable]] which applies the action of a list of
    [[GameObjectsAssociation]] causing their associated GameObjects to be
    (de)activated accordingly.
*** LoadedXrDeviceAssociation                                           :api:
    (De)activates GameObjects based on whether the currently loaded XR
    device name matches the `XrDeviceNamePattern` regular expression.

    - XrDeviceNamePattern: Regular expression to match XR device names.
** Cast
   Behaviours which perform raycasts.
*** Collection
**** Mutation
