docs/zinnia.html

<div id="outline-container-orga7d8dfb" class="outline-3">
<h3 id="orga7d8dfb">Action</h3>
<div class="outline-text-3" id="text-orga7d8dfb">
<p>
Actions have two primary functions:
</p>
<ul class="org-ul">
<li>Receive values</li>
<li>Emit values</li>
</ul>

<p>
There are a few ways an action can recieve values:
</p>
<ul class="org-ul">
<li>Its <code>Receive()</code> method.</li>
<li>An Action in its <code>Sources</code> list.</li>
</ul>

<p>
When an Action receives a value, it also emits it.
</p>

<p>
If an Action is a source for any other Action, values will be
propagated along.
</p>

<p>
Each Action has a number of Unity Events as well:
</p>
<ul class="org-ul">
<li>Activated</li>
<li>Deactivated</li>
<li>Activation State Changed</li>
<li>Value Changed</li>
</ul>

<p>
By using the Value Changed event, you can respond to an Action's
value in basically any way needed.
</p>
</div>

<div id="outline-container-org8b3c014" class="outline-4">
<h4 id="org8b3c014">Collection</h4>
<div class="outline-text-4" id="text-org8b3c014">
<p>
Scripts for observing lists of action related types.
</p>
</div>

<div id="outline-container-org71cc370" class="outline-5">
<h5 id="org71cc370"><span class="api-link" data-link="/db/ddb/class_zinnia_1_1_action_1_1_collection_1_1_action_observable_list.html">ActionObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
<div class="outline-text-5" id="text-org71cc370">
<p>
Maintains a list of Zinnia Actions and emits events when that
list is changed.
</p>
</div>
</div>

<div id="outline-container-org430fe6d" class="outline-5">
<h5 id="org430fe6d"><span class="api-link" data-link="/d7/d7c/class_zinnia_1_1_action_1_1_collection_1_1_action_registrar_source_observable_list.html">ActionRegistrarSourceObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
<div class="outline-text-5" id="text-org430fe6d">
<p>
Maintains a list of <a href="#org852d29c">ActionRegistrar</a>.ActionSource instances and
emits events when that list changes.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc2c0a40" class="outline-4">
<h4 id="orgc2c0a40"><span class="api-link" data-link="/d4/dc2/class_zinnia_1_1_action_1_1_action.html">Action&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-orgc2c0a40">
<p>
Base class for all <a href="#orga7d8dfb">Action</a> types.
</p>

<p>
Each action has a data-type, like float or GameObject.
</p>

<ul class="org-ul">
<li>Sources: A list of other Actions which this Action listens to.</li>
<li>UnityEvents:
<ul class="org-ul">
<li>Activation State Changed</li>
<li>Activated</li>
<li>Value Changed</li>
<li>Deactivated</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org426c896" class="outline-4">
<h4 id="org426c896"><span class="api-link" data-link="/df/dde/class_zinnia_1_1_action_1_1_all_action.html">AllAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org426c896">
<p>
<a href="#orga7d8dfb">Action</a> that emits a boolean when all the given actions are
`Action.IsActivated`.
</p>

<ul class="org-ul">
<li>Actions: <a href="#org71cc370">ActionObservableList</a> of actions which all need to be
activated.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfcc20f0" class="outline-4">
<h4 id="orgfcc20f0"><span class="api-link" data-link="/df/dea/class_zinnia_1_1_action_1_1_any_action.html">AnyAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-orgfcc20f0">
<p>
<a href="#orga7d8dfb">Action</a> that emits a boolean when any of the given actions are
`Action.IsActivated`.
</p>

<ul class="org-ul">
<li>Actions: <a href="#org71cc370">ActionObservableList</a> of actions any of which need to be
activated.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf42ce1e" class="outline-4">
<h4 id="orgf42ce1e"><span class="api-link" data-link="/de/dc7/class_zinnia_1_1_action_1_1_boolean_action.html">BooleanAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-orgf42ce1e">
<p>
<a href="#orga7d8dfb">Action</a> that receives and emits booleans.
</p>
</div>
</div>

<div id="outline-container-orgc8a145c" class="outline-4">
<h4 id="orgc8a145c"><span class="api-link" data-link="/d4/d7f/class_zinnia_1_1_action_1_1_float_action.html">FloatAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-orgc8a145c">
<p>
<a href="#orga7d8dfb">Action</a> that receives and emits floats.
</p>
</div>
</div>

<div id="outline-container-org568e6f2" class="outline-4">
<h4 id="org568e6f2"><span class="api-link" data-link="/d7/deb/class_zinnia_1_1_action_1_1_state_emitter.html">StateEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org568e6f2">
<p>
An <a href="#orgf33bc95">IProcessable</a> which causes an <a href="#orga7d8dfb">Action</a> to re-emit it's last value
each time the process is run.
</p>
</div>
</div>

<div id="outline-container-orgdb8cb87" class="outline-4">
<h4 id="orgdb8cb87"><span class="api-link" data-link="/d2/d84/class_zinnia_1_1_action_1_1_surface_change_action.html">SurfaceChangeAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-orgdb8cb87">
<p>
<a href="#orga7d8dfb">Action</a> that receives a <a href="#org6e90c89">SurfaceData</a> current and emits when the
current and previous positions exceed the specified distance.
</p>
</div>
</div>

<div id="outline-container-org1ad95a6" class="outline-4">
<h4 id="org1ad95a6"><span class="api-link" data-link="/d2/dea/class_zinnia_1_1_action_1_1_toggle_action.html">ToggleAction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org1ad95a6">
<p>
Alternates between emitting its Activated and Deactivated events
each time Recieve is called.
</p>
</div>
</div>

<div id="outline-container-org7e2af44" class="outline-4">
<h4 id="org7e2af44"><span class="api-link" data-link="/d4/d34/class_zinnia_1_1_action_1_1_vector2_action.html">Vector2Action&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org7e2af44">
<p>
<a href="#orga7d8dfb">Action</a> that recieves and emits Vector2 values.
</p>
</div>
</div>

<div id="outline-container-org852d29c" class="outline-4">
<h4 id="org852d29c"><span class="api-link" data-link="/d2/dae/class_zinnia_1_1_action_1_1_action_registrar.html">ActionRegistrar&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org852d29c">
<p>
Sets the sources of a target <a href="#orga7d8dfb">Action</a> based on a list of other
Actions.
</p>

<p>
The sources of an ActionRegistar are of type `ActionSource` which
are a Action/GameObject pair. The GameObject is the one that
contains the Action.
</p>

<p>
The ActionRegistrar also maintains a list of GameObjects called
the `SourceLimits`. This is basically a filter. Only the
ActionSources that have a GameObject in this list are actually
added as sources to the target Action.
</p>

<ul class="org-ul">
<li>Target: The Action whos sources will be set.</li>
<li>Sources: A list of ActionSources who's Actions will be set as
the sources on the Target action.</li>
<li>SourceLimits: A list of GameObjects denoting valid parent
GameObjects.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga3011de" class="outline-3">
<h3 id="orga3011de">Association</h3>
<div class="outline-text-3" id="text-orga3011de">
<p>
Associations create a relation between some condition and the state
of items in a collection.
</p>

<p>
That is to say, some aspect of some collection of items, is
determined by some condition.
</p>

<p>
The only case right now is <a href="#orgd9fa22b">GameObjectsAssociation</a> which relates
whether a collection of GameObjects are (in)active based on some
condition.
</p>
</div>
<div id="outline-container-org6d929f0" class="outline-4">
<h4 id="org6d929f0">Collection</h4>
<div class="outline-text-4" id="text-org6d929f0">
</div>
<div id="outline-container-orga936e9a" class="outline-5">
<h5 id="orga936e9a"><span class="api-link" data-link="/d8/d01/class_zinnia_1_1_association_1_1_collection_1_1_game_objects_association_observable_list.html">GameObjectsAssociationObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
<div class="outline-text-5" id="text-orga936e9a">
<p>
An observable list of <a href="#orgd9fa22b">GameObjectsAssociation</a> instances.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd9fa22b" class="outline-4">
<h4 id="orgd9fa22b"><span class="api-link" data-link="/d0/d34/class_zinnia_1_1_association_1_1_game_objects_association.html">GameObjectsAssociation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-orgd9fa22b">
<p>
Abstract class which references a <a href="#org11c8056">GameObjectObservableList</a> of
objects to (de)activate based on abstract boolean method
`ShouldBeActive`.
</p>
</div>
</div>
<div id="outline-container-orgd05a9e2" class="outline-4">
<h4 id="orgd05a9e2"><span class="api-link" data-link="/d3/de3/class_zinnia_1_1_association_1_1_game_objects_association_activator.html">GameObjectsAssociationActivator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-orgd05a9e2">
<p>
An <a href="#orgf33bc95">IProcessable</a> which applies the action of a list of
<a href="#orgd9fa22b">GameObjectsAssociation</a> causing their associated GameObjects to be
(de)activated accordingly.
</p>
</div>
</div>
<div id="outline-container-org11ced9d" class="outline-4">
<h4 id="org11ced9d"><span class="api-link" data-link="/dd/db3/class_zinnia_1_1_association_1_1_loaded_xr_device_association.html">LoadedXrDeviceAssociation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org11ced9d">
<p>
(De)activates GameObjects based on whether the currently loaded XR
device name matches the `XrDeviceNamePattern` regular expression.
</p>

<ul class="org-ul">
<li>XrDeviceNamePattern: Regular expression to match XR device names.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfe6f20d" class="outline-3">
<h3 id="orgfe6f20d">Cast</h3>
<div class="outline-text-3" id="text-orgfe6f20d">
<p>
Behaviours which perform raycasts.
</p>
</div>
