src/zinnia.org
***** PointsCastPropertyMutator                                         :api:
      Mutates the properties of a target [[PointsCast]].

      A GameObject maybe set as the `Target` using the `SetTarget`
      method which will search for the [[PointsCast]] as either a direct,
      descendant, or ancestor.

*** PhysicsCast                                                         :api:
    A MonoBehaviour which allows for customizing the settings of a
    Raycast at edit time in the inspector. This can be used by the
    various casting components.

*** PointsCast                                                          :api:
    Abstract [[IProcessable]] for casting components that result in points
    along the cast.

    Each subclass must implement the `DoCastPoints` method. Hits are
    filtered through the `TargetValidity` rule.

    - Origin: Starting point of the cast.
    - PhysicsCast: An optional [[PhysicsCast]] to configure the raycast.
    - TargetValidity: [[RuleContainer]] controlling which hits are valid.
    - DestinationPointOverride: Override the destination location
      point in world space.
    - TargetHit: `RaycastHit` of the latest hit, or null.
    - IsTargetHitValid: Whether the latest `TargetHit` is valid based
      on `TargetValidity` rule.
    - Points: The points along the most recent cast.
    - EventData: The [[EventData]] for the latest cast.

**** EventData                                                          :api:
     Holds data about a [[PointsCast]] event.

     - HitData: `RaycastHit?` The result of the most recent
       cast. `null` when it didn't hit anything.
     - IsValid: Whether most recent HitData is valid based on the
       TargetValidity rule.
     - Points: Vector3 points along the most recent cast.

*** FixedLineCast                                                       :api:
    A [[StraightLineCast]] except that it only checks for hits at the end
    of the limited-distance raycast. If no hit is detected, the second
    point returned is `null`.

*** StraightLineCast                                                    :api:
    A [[PointsCast]] which performs a raycast from an origin and direction
    to a maximum distance. It returns two points. The first point is
    the origin. The second point is either the maximum position of the
    line, or the location of any collider hit along the way.

*** ParabolicLineCast                                                   :api:
    A [[PointsCast]] which returns the points at the origin, target, and a
    parabolic arc of points in between.

** TODO Data
*** Attribute
    These attributes are used by other Zinnia components to customize
    their inspector interface. You probably wont need to use these
    yourself.

**** CustomInspectorTextAttribute                                       :api:
     Allows for specifing custom text in Zinnia component inspectors.

**** MinMaxRangeAttribute                                               :api:
     Allows for defining a min and max range for float fields in
     Zinnia component inspectors.

**** RestrictedAttribute                                                :api:
     Allows for making fields non-editable in Zinnia component
     inspectors.

**** TypePickerAttribute                                                :api:
     Allow for displaying pickers for
     `Zinnia.Data.Type.SerializableType` fields in Zinnia component
     inspectors.
*** Collection
**** Counter
***** ObservableCounter                                                 :api:
      Allows counting the amount of attempts an element is added or
      removed from a Dictionary. 

      You can ~IncreaseCount(element)~ to increase the count.
      You can ~DecreaseCount(element)~ to decrease it.
      ~RemoveFromCount(element)~ will remove it completely.
      And ~Clear()~ will remove all entries.

      Being an observable it also features a number of events you can
      respond to:

      - Added: when an element is added for the first time
      - Removed: when an element is removed completely

***** GameObjectObservableCounter                                       :api:
      A [[ObservableCounter]] for GameObjects.
**** List
     [[ObservableList]] based components that hold a list of objects
     of a certain type.
