docs/zinnia.html
<div id="outline-container-org3748b35" class="outline-4">
<h4 id="org3748b35">Collection</h4>
<div class="outline-text-4" id="text-org3748b35">
</div>
<div id="outline-container-org091ce7a" class="outline-5">
<h5 id="org091ce7a">Mutation</h5>
<div class="outline-text-5" id="text-org091ce7a">
</div>
<div id="outline-container-org28399b0" class="outline-6">
<h6 id="org28399b0"><span class="api-link" data-link="/d1/da3/class_zinnia_1_1_cast_1_1_operation_1_1_mutation_1_1_points_cast_property_mutator.html">PointsCastPropertyMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org28399b0">
<p>
Mutates the properties of a target <a href="#org98ecdb1">PointsCast</a>.
</p>

<p>
A GameObject maybe set as the `Target` using the `SetTarget`
method which will search for the <a href="#org98ecdb1">PointsCast</a> as either a direct,
descendant, or ancestor.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org6266a21" class="outline-4">
<h4 id="org6266a21"><span class="api-link" data-link="/d4/d8f/class_zinnia_1_1_cast_1_1_physics_cast.html">PhysicsCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org6266a21">
<p>
A MonoBehaviour which allows for customizing the settings of a
Raycast at edit time in the inspector. This can be used by the
various casting components.
</p>
</div>
</div>

<div id="outline-container-org98ecdb1" class="outline-4">
<h4 id="org98ecdb1"><span class="api-link" data-link="/d7/d7b/class_zinnia_1_1_cast_1_1_points_cast.html">PointsCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org98ecdb1">
<p>
Abstract <a href="#orgf33bc95">IProcessable</a> for casting components that result in points
along the cast.
</p>

<p>
Each subclass must implement the `DoCastPoints` method. Hits are
filtered through the `TargetValidity` rule.
</p>

<ul class="org-ul">
<li>Origin: Starting point of the cast.</li>
<li>PhysicsCast: An optional <a href="#org6266a21">PhysicsCast</a> to configure the raycast.</li>
<li>TargetValidity: <a href="#org153bdb4">RuleContainer</a> controlling which hits are valid.</li>
<li>DestinationPointOverride: Override the destination location
point in world space.</li>
<li>TargetHit: `RaycastHit` of the latest hit, or null.</li>
<li>IsTargetHitValid: Whether the latest `TargetHit` is valid based
on `TargetValidity` rule.</li>
<li>Points: The points along the most recent cast.</li>
<li>EventData: The <a href="#org2de3952">EventData</a> for the latest cast.</li>
</ul>
</div>

<div id="outline-container-org2de3952" class="outline-5">
<h5 id="org2de3952"><span class="api-link" data-link="/dc/de8/class_zinnia_1_1_tracking_1_1_follow_1_1_object_follower_1_1_event_data.html">EventData&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
<div class="outline-text-5" id="text-org2de3952">
<p>
Holds data about a <a href="#org98ecdb1">PointsCast</a> event.
</p>

<ul class="org-ul">
<li>HitData: `RaycastHit?` The result of the most recent
cast. `null` when it didn't hit anything.</li>
<li>IsValid: Whether most recent HitData is valid based on the
TargetValidity rule.</li>
<li>Points: Vector3 points along the most recent cast.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org253cbba" class="outline-4">
<h4 id="org253cbba"><span class="api-link" data-link="/d1/dc3/class_zinnia_1_1_cast_1_1_fixed_line_cast.html">FixedLineCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org253cbba">
<p>
A <a href="#orga1a4a15">StraightLineCast</a> except that it only checks for hits at the end
of the limited-distance raycast. If no hit is detected, the second
point returned is `null`.
</p>
</div>
</div>

<div id="outline-container-orga1a4a15" class="outline-4">
<h4 id="orga1a4a15"><span class="api-link" data-link="/d4/d8e/class_zinnia_1_1_cast_1_1_straight_line_cast.html">StraightLineCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-orga1a4a15">
<p>
A <a href="#org98ecdb1">PointsCast</a> which performs a raycast from an origin and direction
to a maximum distance. It returns two points. The first point is
the origin. The second point is either the maximum position of the
line, or the location of any collider hit along the way.
</p>
</div>
</div>

<div id="outline-container-org2b010ad" class="outline-4">
<h4 id="org2b010ad"><span class="api-link" data-link="/dc/dd0/class_zinnia_1_1_cast_1_1_parabolic_line_cast.html">ParabolicLineCast&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
<div class="outline-text-4" id="text-org2b010ad">
<p>
A <a href="#org98ecdb1">PointsCast</a> which returns the points at the origin, target, and a
parabolic arc of points in between.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb17c8be" class="outline-3">
<h3 id="orgb17c8be">Data</h3>
<div class="outline-text-3" id="text-orgb17c8be">
</div>
<div id="outline-container-orged4930c" class="outline-4">
<h4 id="orged4930c">Attribute</h4>
<div class="outline-text-4" id="text-orged4930c">
<p>
These attributes are used by other Zinnia components to customize
their inspector interface. You probably wont need to use these
yourself.
</p>
</div>

<div id="outline-container-org1ea8550" class="outline-5">
<h5 id="org1ea8550"><span class="api-link" data-link="/db/d13/class_zinnia_1_1_data_1_1_attribute_1_1_custom_inspector_text_attribute.html">CustomInspectorTextAttribute&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
<div class="outline-text-5" id="text-org1ea8550">
<p>
Allows for specifing custom text in Zinnia component inspectors.
</p>
</div>
</div>

<div id="outline-container-org33d3975" class="outline-5">
<h5 id="org33d3975"><span class="api-link" data-link="/d2/d42/class_zinnia_1_1_data_1_1_attribute_1_1_min_max_range_attribute.html">MinMaxRangeAttribute&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
<div class="outline-text-5" id="text-org33d3975">
<p>
Allows for defining a min and max range for float fields in
Zinnia component inspectors.
</p>
</div>
</div>

<div id="outline-container-org8bd2766" class="outline-5">
<h5 id="org8bd2766"><span class="api-link" data-link="/d6/d16/class_zinnia_1_1_data_1_1_attribute_1_1_restricted_attribute.html">RestrictedAttribute&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
<div class="outline-text-5" id="text-org8bd2766">
<p>
Allows for making fields non-editable in Zinnia component
inspectors.
</p>
</div>
</div>

<div id="outline-container-org9030892" class="outline-5">
<h5 id="org9030892"><span class="api-link" data-link="/dd/d90/class_zinnia_1_1_data_1_1_attribute_1_1_type_picker_attribute.html">TypePickerAttribute&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
<div class="outline-text-5" id="text-org9030892">
<p>
Allow for displaying pickers for
`Zinnia.Data.Type.SerializableType` fields in Zinnia component
inspectors.
</p>
</div>
</div>
</div>
<div id="outline-container-org5fc2425" class="outline-4">
<h4 id="org5fc2425">Collection</h4>
<div class="outline-text-4" id="text-org5fc2425">
</div>
<div id="outline-container-orga13d002" class="outline-5">
<h5 id="orga13d002">Counter</h5>
<div class="outline-text-5" id="text-orga13d002">
</div>
<div id="outline-container-org8995fa1" class="outline-6">
<h6 id="org8995fa1"><span class="api-link" data-link="/d7/d70/class_zinnia_1_1_data_1_1_collection_1_1_counter_1_1_observable_counter.html">ObservableCounter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org8995fa1">
<p>
Allows counting the amount of attempts an element is added or
removed from a Dictionary. 
</p>

<p>
You can <code>IncreaseCount(element)</code> to increase the count.
You can <code>DecreaseCount(element)</code> to decrease it.
<code>RemoveFromCount(element)</code> will remove it completely.
And <code>Clear()</code> will remove all entries.
</p>

<p>
Being an observable it also features a number of events you can
respond to:
</p>

<ul class="org-ul">
<li>Added: when an element is added for the first time</li>
<li>Removed: when an element is removed completely</li>
</ul>
</div>
</div>

<div id="outline-container-org5039b51" class="outline-6">
<h6 id="org5039b51"><span class="api-link" data-link="/d9/db6/class_zinnia_1_1_data_1_1_collection_1_1_counter_1_1_game_object_observable_counter.html">GameObjectObservableCounter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org5039b51">
<p>
A <a href="#org8995fa1">ObservableCounter</a> for GameObjects.
</p>
</div>
</div>
</div>
<div id="outline-container-org2f16599" class="outline-5">
<h5 id="org2f16599">List</h5>
<div class="outline-text-5" id="text-org2f16599">
<p>
<a href="#org278f25f">ObservableList</a> based components that hold a list of objects
of a certain type.
</p>
</div>
