src/zinnia.org
***** ObservableList                                                    :api:
      Holds a list of objects of a given type and has a number of
      events for responding when that list changes.

      You can ~Add(element)~ or ~Remove(element)~ add and remove
      items. Many methods have "Unique" version, like
      ~AddUnique(element)~ to prevent duplication. Check the API
      documentation for the full method listing.

      It has a ~CurrentIndex~ which you can use for stuff. It gets
      clamped based on how many items there are. Most methods that
      take an index will similarly clamp it.

      The items in the list can be accessed via ~SubscribableElements~
      and ~NonSubscribableElements~ depending on whether you care to
      keep track item membership on the items themselves. You probably
      just want ~SubscribableElements~.

      Use ~Contains~ to check if an item is in the list.

      There are a number of events you can subscribe to such ass
      ~Added~, ~Removed~, ~Emptied~ and so on. Check the API docs for
      the full listing.
***** BehaviourObservableList                                           :api:
      An [[ObservableList]] that holds ~Behaviour~-based types.
***** DefaultObservableList                                             :api:
      An intermediate class between [[ObservableList]] and the type
      specific classes to prevent some duplicate code. You probably
      don't need to use this directly.
***** FloatObservableList                                               :api:
      An [[ObservableList]] that holds ~float~ values.
***** GameObjectObservableList                                          :api:
      An [[ObservableList]] that holds GameObject references.
***** GameObjectRelationObservableList                                  :api:
      An [[ObservableList]] that holds ~GameObjectRelationObservableList.Relation~ values.

      A ~Relation~ is a type with two GameObject fields:
      - ~Key~, a GameObject
      - ~Value~, a GameObject
      
***** TODO SerializableTypeBehaviourObservableList                      :api:
***** TODO SerializableTypeComponentObservableList                      :api:
***** StringObservableList                                              :api:
      An [[ObservableList]] that holds ~string~ values.
***** UnityObjectObservableList                                         :api:
      An [[ObservableList]] that holds ~UnityObject~ references.
***** Vector2ObservableList                                             :api:
      An [[ObservableList]] that holds ~Vector2~ values.
***** Vector3ObservableList                                             :api:
      An [[ObservableList]] that holds ~Vector3~ values.
**** Stack
***** ObservableStack                                                   :api:
      Holds a stack of objects of a given type and has a number of
      events for responding when that stack changes.

      You can ~Push(element)~ or ~Pop()~ elements.

      You can get the items in the stack with the ~Stack~ property.

      There are a number of events you can listen to such ~Pushed~,
      ~Popped~ and others. Check the API docs for a full reference.

***** GameObjectObservableStack                                         :api:
      An [[ObservableStack]] that holds GameObject references.
*** Enum
**** TransformProperties
     A simple enum denoting ~Position~, ~Rotation~ or ~Scale~.
*** TODO Operation
**** TODO Extraction
     Extraction components return a specific piece of data from a
     referenced object.
***** TODO GameObjectExtractor                                          :api:
      Abstract class for extractors returning GameObjects.

***** TODO ComponentGameObjectExtractor                                 :api:
***** TODO SurfaceDataCollisionPointExtractor                           :api:
***** TODO TransformDataGameObjectExtractor                             :api:
***** TODO TransformDirectionExtractor                                  :api:
***** TODO TransformEulerRotationExtractor                              :api:
***** TODO TransformPositionExtractor                                   :api:
***** TODO TransformPropertyExtractor                                   :api:
