docs/zinnia.html
<div id="outline-container-org278f25f" class="outline-6">
<h6 id="org278f25f"><span class="api-link" data-link="/dd/d86/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_observable_list.html">ObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org278f25f">
<p>
Holds a list of objects of a given type and has a number of
events for responding when that list changes.
</p>

<p>
You can <code>Add(element)</code> or <code>Remove(element)</code> add and remove
items. Many methods have "Unique" version, like
<code>AddUnique(element)</code> to prevent duplication. Check the API
documentation for the full method listing.
</p>

<p>
It has a <code>CurrentIndex</code> which you can use for stuff. It gets
clamped based on how many items there are. Most methods that
take an index will similarly clamp it.
</p>

<p>
The items in the list can be accessed via <code>SubscribableElements</code>
and <code>NonSubscribableElements</code> depending on whether you care to
keep track item membership on the items themselves. You probably
just want <code>SubscribableElements</code>.
</p>

<p>
Use <code>Contains</code> to check if an item is in the list.
</p>

<p>
There are a number of events you can subscribe to such ass
<code>Added</code>, <code>Removed</code>, <code>Emptied</code> and so on. Check the API docs for
the full listing.
</p>
</div>
</div>
<div id="outline-container-org7d394dc" class="outline-6">
<h6 id="org7d394dc"><span class="api-link" data-link="/d2/dfb/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_behaviour_observable_list.html">BehaviourObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org7d394dc">
<p>
An <a href="#org278f25f">ObservableList</a> that holds <code>Behaviour</code>-based types.
</p>
</div>
</div>
<div id="outline-container-org17babf5" class="outline-6">
<h6 id="org17babf5"><span class="api-link" data-link="/d0/dc5/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_default_observable_list.html">DefaultObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org17babf5">
<p>
An intermediate class between <a href="#org278f25f">ObservableList</a> and the type
specific classes to prevent some duplicate code. You probably
don't need to use this directly.
</p>
</div>
</div>
<div id="outline-container-org4afe1d1" class="outline-6">
<h6 id="org4afe1d1"><span class="api-link" data-link="/de/d32/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_float_observable_list.html">FloatObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org4afe1d1">
<p>
An <a href="#org278f25f">ObservableList</a> that holds <code>float</code> values.
</p>
</div>
</div>
<div id="outline-container-org11c8056" class="outline-6">
<h6 id="org11c8056"><span class="api-link" data-link="/d3/d48/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_game_object_observable_list.html">GameObjectObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org11c8056">
<p>
An <a href="#org278f25f">ObservableList</a> that holds GameObject references.
</p>
</div>
</div>
<div id="outline-container-org4dd9eec" class="outline-6">
<h6 id="org4dd9eec"><span class="api-link" data-link="/de/da0/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_game_object_relation_observable_list.html">GameObjectRelationObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org4dd9eec">
<p>
An <a href="#org278f25f">ObservableList</a> that holds <code>GameObjectRelationObservableList.Relation</code> values.
</p>

<p>
A <code>Relation</code> is a type with two GameObject fields:
</p>
<ul class="org-ul">
<li><code>Key</code>, a GameObject</li>
<li><code>Value</code>, a GameObject</li>
</ul>
</div>
</div>

<div id="outline-container-org445e965" class="outline-6">
<h6 id="org445e965"><span class="api-link" data-link="/de/dd6/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_serializable_type_behaviour_observable_list.html">SerializableTypeBehaviourObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-orga9a6553" class="outline-6">
<h6 id="orga9a6553"><span class="api-link" data-link="/d1/d04/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_serializable_type_component_observable_list.html">SerializableTypeComponentObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-orgae27e76" class="outline-6">
<h6 id="orgae27e76"><span class="api-link" data-link="/dc/d08/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_string_observable_list.html">StringObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-orgae27e76">
<p>
An <a href="#org278f25f">ObservableList</a> that holds <code>string</code> values.
</p>
</div>
</div>
<div id="outline-container-org8acfa2c" class="outline-6">
<h6 id="org8acfa2c"><span class="api-link" data-link="/d8/d1b/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_unity_object_observable_list.html">UnityObjectObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org8acfa2c">
<p>
An <a href="#org278f25f">ObservableList</a> that holds <code>UnityObject</code> references.
</p>
</div>
</div>
<div id="outline-container-org0d866f7" class="outline-6">
<h6 id="org0d866f7"><span class="api-link" data-link="/da/d02/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_vector2_observable_list.html">Vector2ObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org0d866f7">
<p>
An <a href="#org278f25f">ObservableList</a> that holds <code>Vector2</code> values.
</p>
</div>
</div>
<div id="outline-container-org5c8522d" class="outline-6">
<h6 id="org5c8522d"><span class="api-link" data-link="/d6/df5/class_zinnia_1_1_data_1_1_collection_1_1_list_1_1_vector3_observable_list.html">Vector3ObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org5c8522d">
<p>
An <a href="#org278f25f">ObservableList</a> that holds <code>Vector3</code> values.
</p>
</div>
</div>
</div>
<div id="outline-container-org93f11d0" class="outline-5">
<h5 id="org93f11d0">Stack</h5>
<div class="outline-text-5" id="text-org93f11d0">
</div>
<div id="outline-container-org2392f5e" class="outline-6">
<h6 id="org2392f5e"><span class="api-link" data-link="/d3/d88/class_zinnia_1_1_data_1_1_collection_1_1_stack_1_1_observable_stack.html">ObservableStack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org2392f5e">
<p>
Holds a stack of objects of a given type and has a number of
events for responding when that stack changes.
</p>

<p>
You can <code>Push(element)</code> or <code>Pop()</code> elements.
</p>

<p>
You can get the items in the stack with the <code>Stack</code> property.
</p>

<p>
There are a number of events you can listen to such <code>Pushed</code>,
<code>Popped</code> and others. Check the API docs for a full reference.
</p>
</div>
</div>

<div id="outline-container-org8052ffe" class="outline-6">
<h6 id="org8052ffe"><span class="api-link" data-link="/df/d41/class_zinnia_1_1_data_1_1_collection_1_1_stack_1_1_game_object_observable_stack.html">GameObjectObservableStack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org8052ffe">
<p>
An <a href="#org2392f5e">ObservableStack</a> that holds GameObject references.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orga7f5d8b" class="outline-4">
<h4 id="orga7f5d8b">Enum</h4>
<div class="outline-text-4" id="text-orga7f5d8b">
</div>
<div id="outline-container-org5fef296" class="outline-5">
<h5 id="org5fef296">TransformProperties</h5>
<div class="outline-text-5" id="text-org5fef296">
<p>
A simple enum denoting <code>Position</code>, <code>Rotation</code> or <code>Scale</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd5b3d43" class="outline-4">
<h4 id="orgd5b3d43">Operation</h4>
<div class="outline-text-4" id="text-orgd5b3d43">
</div>
<div id="outline-container-orgd8b4cfd" class="outline-5">
<h5 id="orgd8b4cfd">Extraction</h5>
<div class="outline-text-5" id="text-orgd8b4cfd">
<p>
Extraction components return a specific piece of data from a
referenced object.
</p>
</div>
<div id="outline-container-orgc3f975b" class="outline-6">
<h6 id="orgc3f975b"><span class="api-link" data-link="/d5/d9a/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_game_object_extractor.html">GameObjectExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-orgc3f975b">
<p>
Abstract class for extractors returning GameObjects.
</p>
</div>
</div>

<div id="outline-container-orga21ad28" class="outline-6">
<h6 id="orga21ad28"><span class="api-link" data-link="/db/d86/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_component_game_object_extractor.html">ComponentGameObjectExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org0ea20f2" class="outline-6">
<h6 id="org0ea20f2"><span class="api-link" data-link="/da/d50/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_surface_data_collision_point_extractor.html">SurfaceDataCollisionPointExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org0b95df2" class="outline-6">
<h6 id="org0b95df2"><span class="api-link" data-link="/dd/d73/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_data_game_object_extractor.html">TransformDataGameObjectExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org32cd3fc" class="outline-6">
<h6 id="org32cd3fc"><span class="api-link" data-link="/de/d8a/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_direction_extractor.html">TransformDirectionExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org0876868" class="outline-6">
<h6 id="org0876868"><span class="api-link" data-link="/da/d9c/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_euler_rotation_extractor.html">TransformEulerRotationExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-orge87de73" class="outline-6">
<h6 id="orge87de73"><span class="api-link" data-link="/d1/d3d/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_position_extractor.html">TransformPositionExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-orgf8a18f5" class="outline-6">
<h6 id="orgf8a18f5"><span class="api-link" data-link="/db/dee/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_property_extractor.html">TransformPropertyExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
