src/zinnia.org
***** TODO TransformScaleExtractor                                      :api:
***** TODO Vector2ComponentExtractor                                    :api:
***** TODO Vector3Extractor                                             :api:
**** TODO Mutation
***** TODO RigidbodyPropertyMutator                                     :api:
***** TODO TransformEulerRotationMutator                                :api:
***** TODO TransformPositionMutator                                     :api:
***** TODO TransformPropertyMutator                                     :api:
***** TODO TransformScaleMutator                                        :api:
**** GameObjectCloner
     Produces clones of a GameObject.

     Set ~Source~ to the GameObject to clone and optionally specify a
     ~Parent~ to add clones under. Calling ~Clone()~ will clone
     ~Source~ or you can clone any GameObject by calling
     ~Clone(source)~.

     A single event is raised ~Cloned~.
*** TODO Type
**** TODO Transformation
***** TODO Aggregation
****** TODO CollectionAggregator                                        :api:
****** TODO FloatAdder                                                  :api:
****** TODO FloatMultiplier                                             :api:
****** TODO Vector2Multiplier                                           :api:
****** TODO Vector3Multiplier                                           :api:
****** TODO Vector3Subtractor                                           :api:
***** TODO Conversion
****** TODO AngleToVector2Direction                                     :api:
****** TODO BooleanToFloat                                              :api:
****** TODO FloatToBoolean                                              :api:
****** TODO FloatToVector2                                              :api:
****** TODO FloatToVector3                                              :api:
****** TODO Vector2ToAngle                                              :api:
****** TODO Vector2ToFloat                                              :api:
****** TODO Vector2ToVector3                                            :api:
****** TODO Vector3ToFloat                                              :api:
****** TODO Vector3ToVector2                                            :api:
***** TODO FloatRangeValueRemapper                                      :api:
***** TODO Transformer                                                  :api:
***** TODO Vector3MagnitudeSetter                                       :api:
***** TODO Vector3Restrictor                                            :api:
**** TODO FloatRange
**** TODO HeapAllocationFreeReadOnlyList
**** TODO SerializableType                                              :api:
**** TODO SurfaceData                                                   :api:
**** TODO TransformData                                                 :api:
**** TODO Vector3State
** TODO Event
*** TODO Proxy
**** TODO EmptyEventProxyEmitter                                        :api:
**** TODO EventProxyEmitter                                             :api:
**** TODO FloatEventProxyEmitter                                        :api:
