docs/zinnia.html
<div id="outline-container-orga8ff79f" class="outline-6">
<h6 id="orga8ff79f"><span class="api-link" data-link="/d4/d34/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_transform_scale_extractor.html">TransformScaleExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org4451b21" class="outline-6">
<h6 id="org4451b21"><span class="api-link" data-link="/d8/da7/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_vector2_component_extractor.html">Vector2ComponentExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-orgaf344bf" class="outline-6">
<h6 id="orgaf344bf"><span class="api-link" data-link="/d5/dc9/class_zinnia_1_1_data_1_1_operation_1_1_extraction_1_1_vector3_extractor.html">Vector3Extractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
</div>
<div id="outline-container-orged0369f" class="outline-5">
<h5 id="orged0369f">Mutation</h5>
<div class="outline-text-5" id="text-orged0369f">
</div>
<div id="outline-container-org9ff3c5d" class="outline-6">
<h6 id="org9ff3c5d"><span class="api-link" data-link="/d8/d88/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_rigidbody_property_mutator.html">RigidbodyPropertyMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org2e589f1" class="outline-6">
<h6 id="org2e589f1"><span class="api-link" data-link="/d7/d80/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_transform_euler_rotation_mutator.html">TransformEulerRotationMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org276929b" class="outline-6">
<h6 id="org276929b"><span class="api-link" data-link="/da/d3b/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_transform_position_mutator.html">TransformPositionMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org0e8d396" class="outline-6">
<h6 id="org0e8d396"><span class="api-link" data-link="/dc/d65/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_transform_property_mutator.html">TransformPropertyMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org16f091d" class="outline-6">
<h6 id="org16f091d"><span class="api-link" data-link="/d0/d26/class_zinnia_1_1_data_1_1_operation_1_1_mutation_1_1_transform_scale_mutator.html">TransformScaleMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
</div>
<div id="outline-container-orge40c072" class="outline-5">
<h5 id="orge40c072">GameObjectCloner</h5>
<div class="outline-text-5" id="text-orge40c072">
<p>
Produces clones of a GameObject.
</p>

<p>
Set <code>Source</code> to the GameObject to clone and optionally specify a
<code>Parent</code> to add clones under. Calling <code>Clone()</code> will clone
<code>Source</code> or you can clone any GameObject by calling
<code>Clone(source)</code>.
</p>

<p>
A single event is raised <code>Cloned</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org957c4cb" class="outline-4">
<h4 id="org957c4cb">Type</h4>
<div class="outline-text-4" id="text-org957c4cb">
</div>
<div id="outline-container-org28527c3" class="outline-5">
<h5 id="org28527c3">Transformation</h5>
<div class="outline-text-5" id="text-org28527c3">
</div>
<div id="outline-container-orgd48ef79" class="outline-6">
<h6 id="orgd48ef79">Aggregation</h6>
<div class="outline-text-6" id="text-orgd48ef79">
</div>
<div id="outline-container-org8ba1feb" class="outline-7">
<h7 id="org8ba1feb"><span class="api-link" data-link="/db/d2d/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_collection_aggregator.html">CollectionAggregator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-org4380aac" class="outline-7">
<h7 id="org4380aac"><span class="api-link" data-link="/dc/d70/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_float_adder.html">FloatAdder&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-org65e88e1" class="outline-7">
<h7 id="org65e88e1"><span class="api-link" data-link="/d3/d88/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_float_multiplier.html">FloatMultiplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-orgebd1b76" class="outline-7">
<h7 id="orgebd1b76"><span class="api-link" data-link="/d8/d46/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_vector2_multiplier.html">Vector2Multiplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-orgeca8866" class="outline-7">
<h7 id="orgeca8866"><span class="api-link" data-link="/d6/d1c/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_vector3_multiplier.html">Vector3Multiplier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-org7670297" class="outline-7">
<h7 id="org7670297"><span class="api-link" data-link="/d5/d4f/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_aggregation_1_1_vector3_subtractor.html">Vector3Subtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
</div>
<div id="outline-container-org93eef08" class="outline-6">
<h6 id="org93eef08">Conversion</h6>
<div class="outline-text-6" id="text-org93eef08">
</div>
<div id="outline-container-org1972ccc" class="outline-7">
<h7 id="org1972ccc"><span class="api-link" data-link="/d2/d12/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_angle_to_vector2_direction.html">AngleToVector2Direction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-orgfd887f6" class="outline-7">
<h7 id="orgfd887f6"><span class="api-link" data-link="/de/d52/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_boolean_to_float.html">BooleanToFloat&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-org90c025c" class="outline-7">
<h7 id="org90c025c"><span class="api-link" data-link="/de/d34/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_float_to_boolean.html">FloatToBoolean&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-orge5d86f3" class="outline-7">
<h7 id="orge5d86f3"><span class="api-link" data-link="/d2/dfd/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_float_to_vector2.html">FloatToVector2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-org438070d" class="outline-7">
<h7 id="org438070d"><span class="api-link" data-link="/dd/df5/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_float_to_vector3.html">FloatToVector3&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-org188e9ba" class="outline-7">
<h7 id="org188e9ba"><span class="api-link" data-link="/db/d3d/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector2_to_angle.html">Vector2ToAngle&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-org46725c2" class="outline-7">
<h7 id="org46725c2"><span class="api-link" data-link="/d8/dc3/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector2_to_float.html">Vector2ToFloat&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-orgf979e9f" class="outline-7">
<h7 id="orgf979e9f"><span class="api-link" data-link="/d2/dd2/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector2_to_vector3.html">Vector2ToVector3&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-orgc35dc6e" class="outline-7">
<h7 id="orgc35dc6e"><span class="api-link" data-link="/d0/d38/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector3_to_float.html">Vector3ToFloat&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-org5f294ee" class="outline-7">
<h7 id="org5f294ee"><span class="api-link" data-link="/d5/d3d/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_conversion_1_1_vector3_to_vector2.html">Vector3ToVector2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
</div>
<div id="outline-container-orga8ebc73" class="outline-6">
<h6 id="orga8ebc73"><span class="api-link" data-link="/dd/d34/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_float_range_value_remapper.html">FloatRangeValueRemapper&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-orgc25a707" class="outline-6">
<h6 id="orgc25a707"><span class="api-link" data-link="/d0/d23/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_transformer.html">Transformer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org2f68474" class="outline-6">
<h6 id="org2f68474"><span class="api-link" data-link="/d7/d44/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_vector3_magnitude_setter.html">Vector3MagnitudeSetter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
<div id="outline-container-org2b3929b" class="outline-6">
<h6 id="org2b3929b"><span class="api-link" data-link="/df/d56/class_zinnia_1_1_data_1_1_type_1_1_transformation_1_1_vector3_restrictor.html">Vector3Restrictor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
</div>
<div id="outline-container-org51eb8f3" class="outline-5">
<h5 id="org51eb8f3">FloatRange</h5>
</div>
<div id="outline-container-orge08c876" class="outline-5">
<h5 id="orge08c876">HeapAllocationFreeReadOnlyList</h5>
</div>
<div id="outline-container-org1c663ae" class="outline-5">
<h5 id="org1c663ae"><span class="api-link" data-link="/d3/d9b/class_zinnia_1_1_data_1_1_type_1_1_serializable_type.html">SerializableType&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org6e90c89" class="outline-5">
<h5 id="org6e90c89"><span class="api-link" data-link="/dc/d32/class_zinnia_1_1_data_1_1_type_1_1_surface_data.html">SurfaceData&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org9b964ac" class="outline-5">
<h5 id="org9b964ac"><span class="api-link" data-link="/d2/dc6/class_zinnia_1_1_data_1_1_type_1_1_transform_data.html">TransformData&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org8ddcfce" class="outline-5">
<h5 id="org8ddcfce">Vector3State</h5>
</div>
</div>
</div>
<div id="outline-container-orgfe10611" class="outline-3">
<h3 id="orgfe10611">Event</h3>
<div class="outline-text-3" id="text-orgfe10611">
</div>
<div id="outline-container-org8066e73" class="outline-4">
<h4 id="org8066e73">Proxy</h4>
<div class="outline-text-4" id="text-org8066e73">
</div>
<div id="outline-container-org7962e08" class="outline-5">
<h5 id="org7962e08"><span class="api-link" data-link="/d3/de4/class_zinnia_1_1_event_1_1_proxy_1_1_empty_event_proxy_emitter.html">EmptyEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org394140c" class="outline-5">
<h5 id="org394140c"><span class="api-link" data-link="/d6/d15/class_zinnia_1_1_event_1_1_proxy_1_1_event_proxy_emitter.html">EventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org1a22a9f" class="outline-5">
<h5 id="org1a22a9f"><span class="api-link" data-link="/d9/d64/class_zinnia_1_1_event_1_1_proxy_1_1_float_event_proxy_emitter.html">FloatEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
