docs/zinnia.html
<div id="outline-container-org4df8697" class="outline-5">
<h5 id="org4df8697"><span class="api-link" data-link="/db/da4/class_zinnia_1_1_event_1_1_proxy_1_1_game_object_event_proxy_emitter.html">GameObjectEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orge64f52a" class="outline-5">
<h5 id="orge64f52a"><span class="api-link" data-link="/df/d94/class_zinnia_1_1_event_1_1_proxy_1_1_restrictable_single_event_proxy_emitter.html">RestrictableSingleEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orgbbfa69a" class="outline-5">
<h5 id="orgbbfa69a"><span class="api-link" data-link="/d7/d74/class_zinnia_1_1_event_1_1_proxy_1_1_single_event_proxy_emitter.html">SingleEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orgda68f70" class="outline-5">
<h5 id="orgda68f70"><span class="api-link" data-link="/d8/d49/class_zinnia_1_1_event_1_1_proxy_1_1_surface_data_proxy_emitter.html">SurfaceDataProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org697ac10" class="outline-5">
<h5 id="org697ac10"><span class="api-link" data-link="/d0/d34/class_zinnia_1_1_event_1_1_proxy_1_1_transform_data_proxy_emitter.html">TransformDataProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
</div>
<div id="outline-container-org290248b" class="outline-4">
<h4 id="org290248b"><span class="api-link" data-link="/d9/d44/class_zinnia_1_1_event_1_1_behaviour_enabled_observer.html">BehaviourEnabledObserver&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
</div>
<div id="outline-container-org014293e" class="outline-3">
<h3 id="org014293e">Extension</h3>
<div class="outline-text-3" id="text-org014293e">
</div>
<div id="outline-container-orgdc31666" class="outline-4">
<h4 id="orgdc31666"><span class="api-link" data-link="/d9/d68/class_zinnia_1_1_extension_1_1_array_sort_extensions.html">ArraySortExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org3d5a0b6" class="outline-4">
<h4 id="org3d5a0b6"><span class="api-link" data-link="/d7/dda/class_zinnia_1_1_extension_1_1_behaviour_extensions.html">BehaviourExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgc77bd9f" class="outline-4">
<h4 id="orgc77bd9f"><span class="api-link" data-link="/dc/dfe/class_zinnia_1_1_extension_1_1_collider_extensions.html">ColliderExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgf4be90a" class="outline-4">
<h4 id="orgf4be90a"><span class="api-link" data-link="/d1/d33/class_zinnia_1_1_extension_1_1_component_extensions.html">ComponentExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgf0000e0" class="outline-4">
<h4 id="orgf0000e0"><span class="api-link" data-link="/d3/de9/class_zinnia_1_1_extension_1_1_float_extensions.html">FloatExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org9a22ee4" class="outline-4">
<h4 id="org9a22ee4"><span class="api-link" data-link="/db/d03/class_zinnia_1_1_extension_1_1_game_object_extensions.html">GameObjectExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org481e6f4" class="outline-4">
<h4 id="org481e6f4"><span class="api-link" data-link="/d7/d81/class_zinnia_1_1_extension_1_1_i_read_only_collection_extensions.html">IReadOnlyCollectionExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org087c9cf" class="outline-4">
<h4 id="org087c9cf"><span class="api-link" data-link="/d3/dea/class_zinnia_1_1_extension_1_1_rule_container_extensions.html">RuleContainerExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org92568db" class="outline-4">
<h4 id="org92568db"><span class="api-link" data-link="/d0/de0/class_zinnia_1_1_extension_1_1_transform_data_extensions.html">TransformDataExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org83c1083" class="outline-4">
<h4 id="org83c1083"><span class="api-link" data-link="/d2/dba/class_zinnia_1_1_extension_1_1_transform_extensions.html">TransformExtensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgbacd65c" class="outline-4">
<h4 id="orgbacd65c"><span class="api-link" data-link="/dd/dfe/class_zinnia_1_1_extension_1_1_vector2_extensions.html">Vector2Extensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orga8352f0" class="outline-4">
<h4 id="orga8352f0"><span class="api-link" data-link="/d5/d57/class_zinnia_1_1_extension_1_1_vector3_extensions.html">Vector3Extensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
</div>
<div id="outline-container-orgddcbde9" class="outline-3">
<h3 id="orgddcbde9">Haptics</h3>
<div class="outline-text-3" id="text-orgddcbde9">
</div>
<div id="outline-container-org066de6d" class="outline-4">
<h4 id="org066de6d">Collection</h4>
<div class="outline-text-4" id="text-org066de6d">
</div>
<div id="outline-container-org62c0b5c" class="outline-5">
<h5 id="org62c0b5c"><span class="api-link" data-link="/de/de1/class_zinnia_1_1_haptics_1_1_collection_1_1_haptic_process_observable_list.html">HapticProcessObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
</div>
<div id="outline-container-org72a4454" class="outline-4">
<h4 id="org72a4454"><span class="api-link" data-link="/d7/dee/class_zinnia_1_1_haptics_1_1_audio_clip_haptic_pulser.html">AudioClipHapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orga84b546" class="outline-4">
<h4 id="orga84b546"><span class="api-link" data-link="/d7/d72/class_zinnia_1_1_haptics_1_1_audio_source_haptic_pulser.html">AudioSourceHapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgf6e272e" class="outline-4">
<h4 id="orgf6e272e"><span class="api-link" data-link="/d6/d06/class_zinnia_1_1_haptics_1_1_haptic_process.html">HapticProcess&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org559fcf7" class="outline-4">
<h4 id="org559fcf7"><span class="api-link" data-link="/d5/d4e/class_zinnia_1_1_haptics_1_1_haptic_processor.html">HapticProcessor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgfe3c03f" class="outline-4">
<h4 id="orgfe3c03f"><span class="api-link" data-link="/d7/d34/class_zinnia_1_1_haptics_1_1_haptic_pulser.html">HapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgdb99927" class="outline-4">
<h4 id="orgdb99927"><span class="api-link" data-link="/d8/dc8/class_zinnia_1_1_haptics_1_1_routine_haptic_pulser.html">RoutineHapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgdea9c5d" class="outline-4">
<h4 id="orgdea9c5d">TimedHapticPulser</h4>
</div>
<div id="outline-container-orgd4329dc" class="outline-4">
<h4 id="orgd4329dc"><span class="api-link" data-link="/dc/d08/class_zinnia_1_1_haptics_1_1_x_r_node_haptic_pulser.html">XRNodeHapticPulser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
</div>
<div id="outline-container-org4154bb5" class="outline-3">
<h3 id="org4154bb5">Pointer</h3>
<div class="outline-text-3" id="text-org4154bb5">
</div>
<div id="outline-container-orgee963f6" class="outline-4">
<h4 id="orgee963f6">Operation</h4>
<div class="outline-text-4" id="text-orgee963f6">
</div>
<div id="outline-container-org6933c97" class="outline-5">
<h5 id="org6933c97">Mutation</h5>
<div class="outline-text-5" id="text-org6933c97">
</div>
<div id="outline-container-orgabd24a5" class="outline-6">
<h6 id="orgabd24a5"><span class="api-link" data-link="/dd/def/class_zinnia_1_1_pointer_1_1_operation_1_1_mutation_1_1_pointer_element_property_mutator.html">PointerElementPropertyMutator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
</div>
</div>
<div id="outline-container-orgb468d26" class="outline-4">
<h4 id="orgb468d26"><span class="api-link" data-link="/df/daa/class_zinnia_1_1_pointer_1_1_object_pointer.html">ObjectPointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orge172bf4" class="outline-4">
<h4 id="orge172bf4"><span class="api-link" data-link="/d1/dcc/class_zinnia_1_1_pointer_1_1_pointer_element.html">PointerElement&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
</div>
<div id="outline-container-org18c187d" class="outline-3">
<h3 id="org18c187d">Process</h3>
<div class="outline-text-3" id="text-org18c187d">
</div>
<div id="outline-container-orga065939" class="outline-4">
<h4 id="orga065939">Component</h4>
<div class="outline-text-4" id="text-orga065939">
</div>
<div id="outline-container-org80de79e" class="outline-5">
<h5 id="org80de79e"><span class="api-link" data-link="/dc/dd4/class_zinnia_1_1_process_1_1_component_1_1_game_object_source_target_processor.html">GameObjectSourceTargetProcessor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orge745819" class="outline-5">
<h5 id="orge745819"><span class="api-link" data-link="/d0/d55/class_zinnia_1_1_process_1_1_component_1_1_source_target_processor.html">SourceTargetProcessor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
</div>
<div id="outline-container-orgc4c0390" class="outline-4">
<h4 id="orgc4c0390">Moment</h4>
<div class="outline-text-4" id="text-orgc4c0390">
</div>
<div id="outline-container-org5051f54" class="outline-5">
<h5 id="org5051f54">Collection</h5>
<div class="outline-text-5" id="text-org5051f54">
</div>
<div id="outline-container-org3887099" class="outline-6">
<h6 id="org3887099"><span class="api-link" data-link="/de/db3/class_zinnia_1_1_process_1_1_moment_1_1_collection_1_1_moment_process_observable_list.html">MomentProcessObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
</div>
<div id="outline-container-orgc84d92c" class="outline-5">
<h5 id="orgc84d92c"><span class="api-link" data-link="/d7/dc7/class_zinnia_1_1_process_1_1_moment_1_1_composite_process.html">CompositeProcess&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orgb9a5282" class="outline-5">
<h5 id="orgb9a5282"><span class="api-link" data-link="/da/dc7/class_zinnia_1_1_process_1_1_moment_1_1_moment_process.html">MomentProcess&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orgdf0de5d" class="outline-5">
<h5 id="orgdf0de5d"><span class="api-link" data-link="/da/d64/class_zinnia_1_1_process_1_1_moment_1_1_moment_processor.html">MomentProcessor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
</div>
<div id="outline-container-orga602407" class="outline-4">
<h4 id="orga602407"><span class="api-link" data-link="/d0/d80/class_zinnia_1_1_process_1_1_event_process.html">EventProcess&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgf33bc95" class="outline-4">
<h4 id="orgf33bc95"><span class="api-link" data-link="/d8/d03/interface_zinnia_1_1_process_1_1_i_processable.html">IProcessable&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
