src/zinnia.org
*** TODO ProcessContainer                                               :api:
** TODO Rule
*** TODO Collection
**** TODO RuleContainerObservableList                                   :api:
**** TODO RulesMatcherElementObservableList                             :api:
*** TODO ActiveInHierarchyRule                                          :api:
*** TODO AllRule                                                        :api:
*** TODO AnyBehaviourEnabledRule                                        :api:
*** TODO AnyComponentTypeRule                                           :api:
*** TODO AnyLayerRule                                                   :api:
*** TODO AnyRule                                                        :api:
*** TODO AnyTagRule                                                     :api:
*** TODO GameObjectRule                                                 :api:
*** TODO IRule                                                          :api:
*** TODO ListContainsRule                                               :api:
*** TODO NegationRule                                                   :api:
*** TODO Rule                                                           :api:
*** TODO RuleContainer                                                  :api:
*** TODO RulesMatcher                                                   :api:
** TODO Tracking
*** TODO CameraRig
**** TODO Collection
***** TODO LinkedAliasAssociationCollectionObservableList               :api:
**** TODO Operation
***** TODO Extraction
****** TODO PlayAreaDimensionsExtractor                                 :api:
**** TODO LinkedAliasAssocationCollection
*** TODO Collision
**** TODO Active
     There are a number of classes that coordinate active collision
     tracking:
     - [[CollisionNotifier]]: Emits events related to collisions.
     - [[CollisionNotifier.EventData]]: Holds information related to
       collisions.
     - [[ActiveCollisionsContainer]]: Holds a collection of current
       collisions raised by a [[CollisionNotifier]].
     - [[ActiveCollisionPublisher]]: Sends collision information to
       the things involved in collisions.
     - [[ActiveCollisionConsumer]]: Receives collision information
       when involved in collisions.

     These classes attempt to communicate data about collisions
     between an [[ActiveCollisionPublisher]] and any number of
     [[ActiveCollisionConsumer]]s.

     When collisions take place, a [[CollisionNotifier]]'s events can
     be configured to add the associated
     [[CollisionNotifier.EventData]] to an
     [[ActiveCollisionsContainer]].

     When an [[ActiveCollisionPublisher]] publishes, it searches all
     of the objects that own colliders being tracked by the
     [[ActiveCollisionsContainer]] for [[ActiveCollisionConsumer]]
     components which it will pass collision data to.
***** TODO Event
****** TODO Proxy
******* TODO ActiveCollisionConsumerEventProxyEmitter                   :api:
******* TODO ActiveCollisionsContainerEventProxyEmitter                 :api:
***** TODO Operation
****** TODO Extraction
******* TODO NotifierContainerExtractor                                 :api:
******* TODO NotifierTargetExtractor                                    :api:
******* TODO PublisherContainerExtractor                                :api:
****** TODO NearestSorter                                               :api:
****** TODO OrderReverser                                               :api:
****** TODO Slicer                                                      :api:
