docs/zinnia.html
<div id="outline-container-org7f317b7" class="outline-4">
<h4 id="org7f317b7"><span class="api-link" data-link="/dd/dd5/class_zinnia_1_1_process_1_1_process_container.html">ProcessContainer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
</div>
<div id="outline-container-orgc5bb529" class="outline-3">
<h3 id="orgc5bb529">Rule</h3>
<div class="outline-text-3" id="text-orgc5bb529">
</div>
<div id="outline-container-orgf75afb3" class="outline-4">
<h4 id="orgf75afb3">Collection</h4>
<div class="outline-text-4" id="text-orgf75afb3">
</div>
<div id="outline-container-orgc8be393" class="outline-5">
<h5 id="orgc8be393"><span class="api-link" data-link="/d3/d31/class_zinnia_1_1_rule_1_1_collection_1_1_rule_container_observable_list.html">RuleContainerObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orgd175179" class="outline-5">
<h5 id="orgd175179"><span class="api-link" data-link="/de/d92/class_zinnia_1_1_rule_1_1_collection_1_1_rules_matcher_element_observable_list.html">RulesMatcherElementObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
</div>
<div id="outline-container-org28b1e9b" class="outline-4">
<h4 id="org28b1e9b"><span class="api-link" data-link="/db/d6e/class_zinnia_1_1_rule_1_1_active_in_hierarchy_rule.html">ActiveInHierarchyRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgc9503f8" class="outline-4">
<h4 id="orgc9503f8"><span class="api-link" data-link="/de/d19/class_zinnia_1_1_rule_1_1_all_rule.html">AllRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org6bbe9f3" class="outline-4">
<h4 id="org6bbe9f3"><span class="api-link" data-link="/d7/de0/class_zinnia_1_1_rule_1_1_any_behaviour_enabled_rule.html">AnyBehaviourEnabledRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org39d04ea" class="outline-4">
<h4 id="org39d04ea"><span class="api-link" data-link="/d5/d13/class_zinnia_1_1_rule_1_1_any_component_type_rule.html">AnyComponentTypeRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgc0a45ad" class="outline-4">
<h4 id="orgc0a45ad"><span class="api-link" data-link="/d7/d9b/class_zinnia_1_1_rule_1_1_any_layer_rule.html">AnyLayerRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgc6150a8" class="outline-4">
<h4 id="orgc6150a8"><span class="api-link" data-link="/d9/dd0/class_zinnia_1_1_rule_1_1_any_rule.html">AnyRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgf487504" class="outline-4">
<h4 id="orgf487504"><span class="api-link" data-link="/dc/d33/class_zinnia_1_1_rule_1_1_any_tag_rule.html">AnyTagRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgee87f26" class="outline-4">
<h4 id="orgee87f26"><span class="api-link" data-link="/dd/d9f/class_zinnia_1_1_rule_1_1_game_object_rule.html">GameObjectRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgda671da" class="outline-4">
<h4 id="orgda671da"><span class="api-link" data-link="/d4/dd5/interface_zinnia_1_1_rule_1_1_i_rule.html">IRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgf2ca785" class="outline-4">
<h4 id="orgf2ca785"><span class="api-link" data-link="/d0/d92/class_zinnia_1_1_rule_1_1_list_contains_rule.html">ListContainsRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-orgb53ca4d" class="outline-4">
<h4 id="orgb53ca4d"><span class="api-link" data-link="/d9/d69/class_zinnia_1_1_rule_1_1_negation_rule.html">NegationRule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org3e520eb" class="outline-4">
<h4 id="org3e520eb"><span class="api-link" data-link="/d4/dad/class_zinnia_1_1_rule_1_1_rule.html">Rule&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org153bdb4" class="outline-4">
<h4 id="org153bdb4"><span class="api-link" data-link="/d7/d35/class_zinnia_1_1_rule_1_1_rule_container.html">RuleContainer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
<div id="outline-container-org3376a2a" class="outline-4">
<h4 id="org3376a2a"><span class="api-link" data-link="/db/da5/class_zinnia_1_1_rule_1_1_rules_matcher.html">RulesMatcher&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h4>
</div>
</div>
<div id="outline-container-orgb3d0755" class="outline-3">
<h3 id="orgb3d0755">Tracking</h3>
<div class="outline-text-3" id="text-orgb3d0755">
</div>
<div id="outline-container-orgb52b8b1" class="outline-4">
<h4 id="orgb52b8b1">CameraRig</h4>
<div class="outline-text-4" id="text-orgb52b8b1">
</div>
<div id="outline-container-orgc438e38" class="outline-5">
<h5 id="orgc438e38">Collection</h5>
<div class="outline-text-5" id="text-orgc438e38">
</div>
<div id="outline-container-orgdda51d5" class="outline-6">
<h6 id="orgdda51d5"><span class="api-link" data-link="/d1/d7f/class_zinnia_1_1_tracking_1_1_camera_rig_1_1_collection_1_1_linked_alias_association_collection_observable_list.html">LinkedAliasAssociationCollectionObservableList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
</div>
<div id="outline-container-org0b0adca" class="outline-5">
<h5 id="org0b0adca">Operation</h5>
<div class="outline-text-5" id="text-org0b0adca">
</div>
<div id="outline-container-org6d8356c" class="outline-6">
<h6 id="org6d8356c">Extraction</h6>
<div class="outline-text-6" id="text-org6d8356c">
</div>
<div id="outline-container-org6a2143a" class="outline-7">
<h7 id="org6a2143a"><span class="api-link" data-link="/d2/d41/class_zinnia_1_1_tracking_1_1_camera_rig_1_1_operation_1_1_extraction_1_1_play_area_dimensions_extractor.html">PlayAreaDimensionsExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
</div>
</div>
<div id="outline-container-org3bbc8c5" class="outline-5">
<h5 id="org3bbc8c5"><span class="api-link" data-link="/d4/d85/class_zinnia_1_1_tracking_1_1_camera_rig_1_1_linked_alias_association_collection.html">LinkedAliasAssociationCollection&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
</div>
<div id="outline-container-orgdbf9704" class="outline-4">
<h4 id="orgdbf9704">Collision</h4>
<div class="outline-text-4" id="text-orgdbf9704">
</div>
<div id="outline-container-org26b4eba" class="outline-5">
<h5 id="org26b4eba">Active</h5>
<div class="outline-text-5" id="text-org26b4eba">
<p>
There are a number of classes that coordinate active collision
tracking:
</p>
<ul class="org-ul">
<li><a href="#org36a492f">CollisionNotifier</a>: Emits events related to collisions.</li>
<li><a href="#orgfd7aa3b">CollisionNotifier.EventData</a>: Holds information related to
collisions.</li>
<li><a href="#orgdacd907">ActiveCollisionsContainer</a>: Holds a collection of current
collisions raised by a <a href="#org36a492f">CollisionNotifier</a>.</li>
<li><a href="#orgb81a4eb">ActiveCollisionPublisher</a>: Sends collision information to
the things involved in collisions.</li>
<li><a href="#org2e7ce3d">ActiveCollisionConsumer</a>: Receives collision information
when involved in collisions.</li>
</ul>

<p>
These classes attempt to communicate data about collisions
between an <a href="#orgb81a4eb">ActiveCollisionPublisher</a> and any number of
<a href="#org2e7ce3d">ActiveCollisionConsumer</a>s.
</p>

<p>
When collisions take place, a <a href="#org36a492f">CollisionNotifier</a>'s events can
be configured to add the associated
<a href="#orgfd7aa3b">CollisionNotifier.EventData</a> to an
<a href="#orgdacd907">ActiveCollisionsContainer</a>.
</p>

<p>
When an <a href="#orgb81a4eb">ActiveCollisionPublisher</a> publishes, it searches all
of the objects that own colliders being tracked by the
<a href="#orgdacd907">ActiveCollisionsContainer</a> for <a href="#org2e7ce3d">ActiveCollisionConsumer</a>
components which it will pass collision data to.
</p>
</div>
<div id="outline-container-org80ece1d" class="outline-6">
<h6 id="org80ece1d">Event</h6>
<div class="outline-text-6" id="text-org80ece1d">
</div>
<div id="outline-container-orgf7db710" class="outline-7">
<h7 id="orgf7db710">Proxy</h7>
<div class="outline-text-7" id="text-orgf7db710">
</div>
<div id="outline-container-org005e969" class="outline-8">
<h8 id="org005e969"><span class="api-link" data-link="/d3/d04/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_event_1_1_proxy_1_1_active_collision_consumer_event_proxy_emitter.html">ActiveCollisionConsumerEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
<div id="outline-container-orgcbad0b8" class="outline-8">
<h8 id="orgcbad0b8"><span class="api-link" data-link="/de/d5c/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_event_1_1_proxy_1_1_active_collisions_container_event_proxy_emitter.html">ActiveCollisionsContainerEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
</div>
</div>
<div id="outline-container-org979f647" class="outline-6">
<h6 id="org979f647">Operation</h6>
<div class="outline-text-6" id="text-org979f647">
</div>
<div id="outline-container-orgb1eb42f" class="outline-7">
<h7 id="orgb1eb42f">Extraction</h7>
<div class="outline-text-7" id="text-orgb1eb42f">
</div>
<div id="outline-container-org14fed43" class="outline-8">
<h8 id="org14fed43"><span class="api-link" data-link="/dc/d70/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_extraction_1_1_notifier_container_extractor.html">NotifierContainerExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
<div id="outline-container-org6af157b" class="outline-8">
<h8 id="org6af157b"><span class="api-link" data-link="/d0/d48/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_extraction_1_1_notifier_target_extractor.html">NotifierTargetExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
<div id="outline-container-org11a16f0" class="outline-8">
<h8 id="org11a16f0"><span class="api-link" data-link="/d5/d68/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_extraction_1_1_publisher_container_extractor.html">PublisherContainerExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
</div>
<div id="outline-container-org1a4e60c" class="outline-7">
<h7 id="org1a4e60c"><span class="api-link" data-link="/d7/d2c/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_nearest_sorter.html">NearestSorter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
<div id="outline-container-org9c71e17" class="outline-7">
<h7 id="org9c71e17"><span class="api-link" data-link="/dc/d82/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_order_reverser.html">OrderReverser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
