src/zinnia.org
***** ActiveCollisionConsumer                                      :api:
      Objects involved in collisions that feature this component will
      recieve information about those collisions from a related
      [[ActiveCollisionPublisher]].
***** ActiveCollisionPublisher                                          :api:
      Publishes itself, and relevant collision information, to any
      [[ActiveCollisionConsumer]] components found on objects within a
      related [[ActiveCollisionsContainer]].
***** ActiveCollisionsContainer                                         :api:
      Holds a collection of current collisions raised by a
      [[CollisionNotifier]].
***** TODO CollisionPointContainer                                      :api:
**** TODO Event
***** TODO Proxy
****** TODO CollisionNotifierEventProxyEmitter                          :api:
**** TODO CollisionIgnorer                                              :api:
**** TODO CollisionNotifier                                             :api:
     Recieves and propagates local collision events via Unity
     Events. The events are propagated as
     [[CollisionNotifier.EventData]] instances.
***** CollisionNotifier.EventData
      Contains information about a collision:

      - ~IsTrigger~ whether the collider was set to ~isTrigger~.
      - ~CollisionData~ the Unity collision event data.
      - ~ColliderData~ the Collider that was involved.
**** TODO CollisionTracker                                              :api:
*** TODO Follow
**** TODO Modifier
***** TODO Property
****** TODO Position
******* TODO RigidbodyVelocity                                          :api:
******* TODO TransformPosition                                          :api:
****** TODO Rotation
******* TODO RigidbodyAngularVelocity                                   :api:
******* TODO RigidbodyForceAtPosition                                   :api:
******* TODO TransformPositionDifferenceRotation                        :api:
******* TODO TransformRotation                                          :api:
****** TODO Scale
******* TODO TransformScale                                             :api:
****** TODO PropertyModifier                                            :api:
***** TODO FollowModifier                                               :api:
**** TODO Operation
***** TODO Extraction
****** TODO ObjectDistanceComparatorEventDataExtractor                  :api:
**** TODO ObjectDistanceComparator                                      :api:
**** TODO ObjectFollower                                                :api:
*** TODO Modification
**** TODO Operation
***** TODO Extraction
****** TODO TransformPropertyApplierEventDataExtractor                  :api:
**** TODO ComponentEnabledStateModifier                                 :api:
**** TODO DirectionModifier                                             :api:
**** TODO GameObjectStateMirror                                         :api:
**** TODO GameObjectStateSwitcher                                       :api:
**** TODO PinchScaler                                                   :api:
**** TODO PointNormalRotator                                            :api:
