docs/zinnia.html
<div id="outline-container-orgc6fa151" class="outline-7">
<h7 id="orgc6fa151"><span class="api-link" data-link="/df/df5/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_operation_1_1_slicer.html">Slicer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
</div>
<div id="outline-container-org2e7ce3d" class="outline-6">
<h6 id="org2e7ce3d"><span class="api-link" data-link="/d4/d0c/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_active_collision_consumer.html">ActiveCollisionConsumer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-org2e7ce3d">
<p>
Objects involved in collisions that feature this component will
recieve information about those collisions from a related
<a href="#orgb81a4eb">ActiveCollisionPublisher</a>.
</p>
</div>
</div>
<div id="outline-container-orgb81a4eb" class="outline-6">
<h6 id="orgb81a4eb"><span class="api-link" data-link="/d7/dd9/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_active_collision_publisher.html">ActiveCollisionPublisher&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-orgb81a4eb">
<p>
Publishes itself, and relevant collision information, to any
<a href="#org2e7ce3d">ActiveCollisionConsumer</a> components found on objects within a
related <a href="#orgdacd907">ActiveCollisionsContainer</a>.
</p>
</div>
</div>
<div id="outline-container-orgdacd907" class="outline-6">
<h6 id="orgdacd907"><span class="api-link" data-link="/d8/db2/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_active_collisions_container.html">ActiveCollisionsContainer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
<div class="outline-text-6" id="text-orgdacd907">
<p>
Holds a collection of current collisions raised by a
<a href="#org36a492f">CollisionNotifier</a>.
</p>
</div>
</div>
<div id="outline-container-org142f069" class="outline-6">
<h6 id="org142f069"><span class="api-link" data-link="/d8/dd7/class_zinnia_1_1_tracking_1_1_collision_1_1_active_1_1_collision_point_container.html">CollisionPointContainer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
</div>
<div id="outline-container-orgbb890c8" class="outline-5">
<h5 id="orgbb890c8">Event</h5>
<div class="outline-text-5" id="text-orgbb890c8">
</div>
<div id="outline-container-org1b8e975" class="outline-6">
<h6 id="org1b8e975">Proxy</h6>
<div class="outline-text-6" id="text-org1b8e975">
</div>
<div id="outline-container-org08ddcc1" class="outline-7">
<h7 id="org08ddcc1"><span class="api-link" data-link="/d7/d33/class_zinnia_1_1_tracking_1_1_collision_1_1_event_1_1_proxy_1_1_collision_notifier_event_proxy_emitter.html">CollisionNotifierEventProxyEmitter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
</div>
</div>
<div id="outline-container-orgf269c2c" class="outline-5">
<h5 id="orgf269c2c"><span class="api-link" data-link="/df/de4/class_zinnia_1_1_tracking_1_1_collision_1_1_collision_ignorer.html">CollisionIgnorer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org36a492f" class="outline-5">
<h5 id="org36a492f"><span class="api-link" data-link="/d1/de4/class_zinnia_1_1_tracking_1_1_collision_1_1_collision_notifier.html">CollisionNotifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
<div class="outline-text-5" id="text-org36a492f">
<p>
Recieves and propagates local collision events via Unity
Events. The events are propagated as
<a href="#orgfd7aa3b">CollisionNotifier.EventData</a> instances.
</p>
</div>
<div id="outline-container-orgfd7aa3b" class="outline-6">
<h6 id="orgfd7aa3b">CollisionNotifier.EventData</h6>
<div class="outline-text-6" id="text-orgfd7aa3b">
<p>
Contains information about a collision:
</p>

<ul class="org-ul">
<li><code>IsTrigger</code> whether the collider was set to <code>isTrigger</code>.</li>
<li><code>CollisionData</code> the Unity collision event data.</li>
<li><code>ColliderData</code> the Collider that was involved.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org051457c" class="outline-5">
<h5 id="org051457c"><span class="api-link" data-link="/dc/def/class_zinnia_1_1_tracking_1_1_collision_1_1_collision_tracker.html">CollisionTracker&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
</div>
<div id="outline-container-org562bf78" class="outline-4">
<h4 id="org562bf78">Follow</h4>
<div class="outline-text-4" id="text-org562bf78">
</div>
<div id="outline-container-org14593a5" class="outline-5">
<h5 id="org14593a5">Modifier</h5>
<div class="outline-text-5" id="text-org14593a5">
</div>
<div id="outline-container-org0efb110" class="outline-6">
<h6 id="org0efb110">Property</h6>
<div class="outline-text-6" id="text-org0efb110">
</div>
<div id="outline-container-org5ffdd29" class="outline-7">
<h7 id="org5ffdd29">Position</h7>
<div class="outline-text-7" id="text-org5ffdd29">
</div>
<div id="outline-container-org1d06288" class="outline-8">
<h8 id="org1d06288"><span class="api-link" data-link="/d8/dbb/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_position_1_1_rigidbody_velocity.html">RigidbodyVelocity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
<div id="outline-container-org4699946" class="outline-8">
<h8 id="org4699946"><span class="api-link" data-link="/d4/d63/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_position_1_1_transform_position.html">TransformPosition&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
</div>
<div id="outline-container-orgeb592fd" class="outline-7">
<h7 id="orgeb592fd">Rotation</h7>
<div class="outline-text-7" id="text-orgeb592fd">
</div>
<div id="outline-container-org7f5cdc4" class="outline-8">
<h8 id="org7f5cdc4"><span class="api-link" data-link="/d6/dae/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_rotation_1_1_rigidbody_angular_velocity.html">RigidbodyAngularVelocity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
<div id="outline-container-org1ff3a25" class="outline-8">
<h8 id="org1ff3a25"><span class="api-link" data-link="/d0/d29/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_rotation_1_1_rigidbody_force_at_position.html">RigidbodyForceAtPosition&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
<div id="outline-container-orgbe2f6ce" class="outline-8">
<h8 id="orgbe2f6ce"><span class="api-link" data-link="/da/d16/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_rotation_1_1_transform_position_difference_rotation.html">TransformPositionDifferenceRotation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
<div id="outline-container-org35416ba" class="outline-8">
<h8 id="org35416ba"><span class="api-link" data-link="/d5/d22/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_rotation_1_1_transform_rotation.html">TransformRotation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
</div>
<div id="outline-container-org69ea326" class="outline-7">
<h7 id="org69ea326">Scale</h7>
<div class="outline-text-7" id="text-org69ea326">
</div>
<div id="outline-container-org8d0b89b" class="outline-8">
<h8 id="org8d0b89b"><span class="api-link" data-link="/d7/d80/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_scale_1_1_transform_scale.html">TransformScale&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h8>
</div>
</div>
<div id="outline-container-org7cac917" class="outline-7">
<h7 id="org7cac917"><span class="api-link" data-link="/d3/d97/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_property_1_1_property_modifier.html">PropertyModifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
</div>
<div id="outline-container-org7a4fb11" class="outline-6">
<h6 id="org7a4fb11"><span class="api-link" data-link="/da/dec/class_zinnia_1_1_tracking_1_1_follow_1_1_modifier_1_1_follow_modifier.html">FollowModifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h6>
</div>
</div>
<div id="outline-container-org7f112ad" class="outline-5">
<h5 id="org7f112ad">Operation</h5>
<div class="outline-text-5" id="text-org7f112ad">
</div>
<div id="outline-container-org106fd3f" class="outline-6">
<h6 id="org106fd3f">Extraction</h6>
<div class="outline-text-6" id="text-org106fd3f">
</div>
<div id="outline-container-orgcdd459f" class="outline-7">
<h7 id="orgcdd459f"><span class="api-link" data-link="/d0/d77/class_zinnia_1_1_tracking_1_1_follow_1_1_operation_1_1_extraction_1_1_object_distance_comparator_event_data_extractor.html">ObjectDistanceComparatorEventDataExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
</div>
</div>
<div id="outline-container-orgcd8dc58" class="outline-5">
<h5 id="orgcd8dc58"><span class="api-link" data-link="/de/dd0/class_zinnia_1_1_tracking_1_1_follow_1_1_object_distance_comparator.html">ObjectDistanceComparator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org7d0d534" class="outline-5">
<h5 id="org7d0d534"><span class="api-link" data-link="/d1/d01/class_zinnia_1_1_tracking_1_1_follow_1_1_object_follower.html">ObjectFollower&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
</div>
<div id="outline-container-orgcd78e5b" class="outline-4">
<h4 id="orgcd78e5b">Modification</h4>
<div class="outline-text-4" id="text-orgcd78e5b">
</div>
<div id="outline-container-orgd9282b7" class="outline-5">
<h5 id="orgd9282b7">Operation</h5>
<div class="outline-text-5" id="text-orgd9282b7">
</div>
<div id="outline-container-org459358f" class="outline-6">
<h6 id="org459358f">Extraction</h6>
<div class="outline-text-6" id="text-org459358f">
</div>
<div id="outline-container-org7aaaa3d" class="outline-7">
<h7 id="org7aaaa3d"><span class="api-link" data-link="/df/d8b/class_zinnia_1_1_tracking_1_1_modification_1_1_operation_1_1_extraction_1_1_transform_property_applier_event_data_extractor.html">TransformPropertyApplierEventDataExtractor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h7>
</div>
</div>
</div>
<div id="outline-container-orga4e24c3" class="outline-5">
<h5 id="orga4e24c3"><span class="api-link" data-link="/df/d54/class_zinnia_1_1_tracking_1_1_modification_1_1_component_enabled_state_modifier.html">ComponentEnabledStateModifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org3593cd4" class="outline-5">
<h5 id="org3593cd4"><span class="api-link" data-link="/dd/d7f/class_zinnia_1_1_tracking_1_1_modification_1_1_direction_modifier.html">DirectionModifier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orga364657" class="outline-5">
<h5 id="orga364657"><span class="api-link" data-link="/d4/d2e/class_zinnia_1_1_tracking_1_1_modification_1_1_game_object_state_mirror.html">GameObjectStateMirror&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-org35d9f0a" class="outline-5">
<h5 id="org35d9f0a"><span class="api-link" data-link="/de/d2d/class_zinnia_1_1_tracking_1_1_modification_1_1_game_object_state_switcher.html">GameObjectStateSwitcher&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orgc777c72" class="outline-5">
<h5 id="orgc777c72"><span class="api-link" data-link="/d8/d9f/class_zinnia_1_1_tracking_1_1_modification_1_1_pinch_scaler.html">PinchScaler&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
<div id="outline-container-orga057ddd" class="outline-5">
<h5 id="orga057ddd"><span class="api-link" data-link="/db/d91/class_zinnia_1_1_tracking_1_1_modification_1_1_point_normal_rotator.html">PointNormalRotator&#xa0;&#xa0;&#xa0;<span class="tag"><span class="api">api</span></span></span></h5>
</div>
