src/zinnia.org
**** TODO TransformPropertyApplier                                      :api:
*** TODO Query
**** TODO FacingQuery                                                   :api:
**** TODO ObscuranceQuery                                               :api:
*** TODO Velocity
**** TODO Collection
***** TODO VelocityTrackerObservableList
**** TODO ArtificialVelocityApplier                                     :api:
**** TODO AverageVelocityEstimator                                      :api:
**** TODO ComponentTrackerProxy                                         :api:
**** TODO VelocityApplier                                               :api:
**** TODO VelocityEmitter                                               :api:
**** TODO VelocityMultiplier                                            :api:
**** TODO VelocityTracker                                               :api:
**** TODO VelocityTrackerProcessor                                      :api:
**** TODO XRNodeVelocityEstimator                                       :api:
*** TODO SurfaceLocator                                                 :api:
** TODO Utility
*** TODO BeizerCurveGenerator
*** TODO CountdownTimer                                                 :api:
*** TODO InterfaceContainer                                             :api:
** TODO Visual
*** TODO CameraColorOverlay                                             :api:
*** TODO PointsRenderer                                                 :api:
